zephyrproject-rtos/zephyr/ext/hal/st/stm32cube/stm32f3xx/drivers/include/stm32f3xx_ll_hrtim.h
/**
  * @brief  Configure an ADC trigger.
  * @rmtoll CR1          ADC1USRC        LL_HRTIM_ConfigADCTrig\n
  * @rmtoll CR1          ADC2USRC        LL_HRTIM_ConfigADCTrig\n
  * @rmtoll CR1          ADC3USRC        LL_HRTIM_ConfigADCTrig\n
  * @rmtoll CR1          ADC4USRC        LL_HRTIM_ConfigADCTrig\n
  * @rmtoll ADC1R        ADC1MC4         LL_HRTIM_ConfigADCTrig\n
  * @rmtoll ADC1R        ADC1MPER        LL_HRTIM_ConfigADCTrig\n
  * @rmtoll ADC1R        ADC1EEV1        LL_HRTIM_ConfigADCTrig\n
  * @rmtoll ADC1R        ADC1EEV2        LL_HRTIM_ConfigADCTrig\n
  * @rmtoll ADC1R        ADC1EEV3        LL_HRTIM_ConfigADCTrig\n
  * @rmtoll ADC1R        ADC1EEV4        LL_HRTIM_ConfigADCTrig\n
  * @rmtoll ADC1R        ADC1EEV5        LL_HRTIM_ConfigADCTrig\n
  * @rmtoll ADC1R        ADC1TAC2        LL_HRTIM_ConfigADCTrig\n
  * @rmtoll ADC1R        ADC1TAC3        LL_HRTIM_ConfigADCTrig\n
  * @rmtoll ADC1R        ADC1TAC4        LL_HRTIM_ConfigADCTrig\n
  * @rmtoll ADC1R        ADC1TAPER       LL_HRTIM_ConfigADCTrig\n
  * @rmtoll ADC1R        ADC1TARST       LL_HRTIM_ConfigADCTrig\n
  * @rmtoll ADC1R        ADC1TBC2        LL_HRTIM_ConfigADCTrig\n
  * @rmtoll ADC1R        ADC1TBC3        LL_HRTIM_ConfigADCTrig\n
  * @rmtoll ADC1R        ADC1TBC4        LL_HRTIM_ConfigADCTrig\n
  * @rmtoll ADC1R        ADC1TBPER       LL_HRTIM_ConfigADCTrig\n
  * @rmtoll ADC1R        ADC1TBRST       LL_HRTIM_ConfigADCTrig\n
  * @rmtoll ADC1R        ADC1TCC2        LL_HRTIM_ConfigADCTrig\n
  * @rmtoll ADC1R        ADC1TCC3        LL_HRTIM_ConfigADCTrig\n
  * @rmtoll ADC1R        ADC1TCC4        LL_HRTIM_ConfigADCTrig\n
  * @rmtoll ADC1R        ADC1TCPER       LL_HRTIM_ConfigADCTrig\n
  * @rmtoll ADC1R        ADC1TDC2        LL_HRTIM_ConfigADCTrig\n
  * @rmtoll ADC1R        ADC1TDC3        LL_HRTIM_ConfigADCTrig\n
  * @rmtoll ADC1R        ADC1TDC4        LL_HRTIM_ConfigADCTrig\n
  * @rmtoll ADC1R        ADC1TDPER       LL_HRTIM_ConfigADCTrig\n
  * @rmtoll ADC1R        ADC1TEC2        LL_HRTIM_ConfigADCTrig\n
  * @rmtoll ADC1R        ADC1TEC3        LL_HRTIM_ConfigADCTrig\n
  * @rmtoll ADC1R        ADC1TEC4        LL_HRTIM_ConfigADCTrig\n
  * @rmtoll ADC1R        ADC1TEPER       LL_HRTIM_ConfigADCTrig\n
  * @rmtoll ADC2R        ADC2MC1         LL_HRTIM_ConfigADCTrig\n
  * @rmtoll ADC2R        ADC2MC2         LL_HRTIM_ConfigADCTrig\n
  * @rmtoll ADC2R        ADC2MC3         LL_HRTIM_ConfigADCTrig\n
  * @rmtoll ADC2R        ADC2MC4         LL_HRTIM_ConfigADCTrig\n
  * @rmtoll ADC2R        ADC2MPER        LL_HRTIM_ConfigADCTrig\n
  * @rmtoll ADC2R        ADC2EEV6        LL_HRTIM_ConfigADCTrig\n
  * @rmtoll ADC2R        ADC2EEV7        LL_HRTIM_ConfigADCTrig\n
  * @rmtoll ADC2R        ADC2EEV8        LL_HRTIM_ConfigADCTrig\n
  * @rmtoll ADC2R        ADC2EEV9        LL_HRTIM_ConfigADCTrig\n
  * @rmtoll ADC2R        ADC2EEV10       LL_HRTIM_ConfigADCTrig\n
  * @rmtoll ADC2R        ADC2TAC2        LL_HRTIM_ConfigADCTrig\n
  * @rmtoll ADC2R        ADC2TAC3        LL_HRTIM_ConfigADCTrig\n
  * @rmtoll ADC2R        ADC2TAC4        LL_HRTIM_ConfigADCTrig\n
  * @rmtoll ADC2R        ADC2TAPER       LL_HRTIM_ConfigADCTrig\n
  * @rmtoll ADC2R        ADC2TBC2        LL_HRTIM_ConfigADCTrig\n
  * @rmtoll ADC2R        ADC2TBC3        LL_HRTIM_ConfigADCTrig\n
  * @rmtoll ADC2R        ADC2TBC4        LL_HRTIM_ConfigADCTrig\n
  * @rmtoll ADC2R        ADC2TBPER       LL_HRTIM_ConfigADCTrig\n
  * @rmtoll ADC2R        ADC2TCC2        LL_HRTIM_ConfigADCTrig\n
  * @rmtoll ADC2R        ADC2TCC3        LL_HRTIM_ConfigADCTrig\n
  * @rmtoll ADC2R        ADC2TCC4        LL_HRTIM_ConfigADCTrig\n
  * @rmtoll ADC2R        ADC2TCPER       LL_HRTIM_ConfigADCTrig\n
  * @rmtoll ADC2R        ADC2TCRST       LL_HRTIM_ConfigADCTrig\n
  * @rmtoll ADC2R        ADC2TDC2        LL_HRTIM_ConfigADCTrig\n
  * @rmtoll ADC2R        ADC2TDC3        LL_HRTIM_ConfigADCTrig\n
  * @rmtoll ADC2R        ADC2TDC4        LL_HRTIM_ConfigADCTrig\n
  * @rmtoll ADC2R        ADC2TDPER       LL_HRTIM_ConfigADCTrig\n
  * @rmtoll ADC2R        ADC2TDRST       LL_HRTIM_ConfigADCTrig\n
  * @rmtoll ADC2R        ADC2TEC2        LL_HRTIM_ConfigADCTrig\n
  * @rmtoll ADC2R        ADC2TEC3        LL_HRTIM_ConfigADCTrig\n
  * @rmtoll ADC2R        ADC2TEC4        LL_HRTIM_ConfigADCTrig\n
  * @rmtoll ADC2R        ADC2TERST       LL_HRTIM_ConfigADCTrig\n
  * @rmtoll ADC3R        ADC3MC1         LL_HRTIM_ConfigADCTrig\n
  * @rmtoll ADC3R        ADC3MC2         LL_HRTIM_ConfigADCTrig\n
  * @rmtoll ADC3R        ADC3MC3         LL_HRTIM_ConfigADCTrig\n
  * @rmtoll ADC3R        ADC3MC4         LL_HRTIM_ConfigADCTrig\n
  * @rmtoll ADC3R        ADC3MPER        LL_HRTIM_ConfigADCTrig\n
  * @rmtoll ADC3R        ADC3EEV1        LL_HRTIM_ConfigADCTrig\n
  * @rmtoll ADC3R        ADC3EEV2        LL_HRTIM_ConfigADCTrig\n
  * @rmtoll ADC3R        ADC3EEV3        LL_HRTIM_ConfigADCTrig\n
  * @rmtoll ADC3R        ADC3EEV4        LL_HRTIM_ConfigADCTrig\n
  * @rmtoll ADC3R        ADC3EEV5        LL_HRTIM_ConfigADCTrig\n
  * @rmtoll ADC3R        ADC3TAC2        LL_HRTIM_ConfigADCTrig\n
  * @rmtoll ADC3R        ADC3TAC3        LL_HRTIM_ConfigADCTrig\n
  * @rmtoll ADC3R        ADC3TAC4        LL_HRTIM_ConfigADCTrig\n
  * @rmtoll ADC3R        ADC3TAPER       LL_HRTIM_ConfigADCTrig\n
  * @rmtoll ADC3R        ADC3TARST       LL_HRTIM_ConfigADCTrig\n
  * @rmtoll ADC3R        ADC3TBC2        LL_HRTIM_ConfigADCTrig\n
  * @rmtoll ADC3R        ADC3TBC3        LL_HRTIM_ConfigADCTrig\n
  * @rmtoll ADC3R        ADC3TBC4        LL_HRTIM_ConfigADCTrig\n
  * @rmtoll ADC3R        ADC3TBPER       LL_HRTIM_ConfigADCTrig\n
  * @rmtoll ADC3R        ADC3TBRST       LL_HRTIM_ConfigADCTrig\n
  * @rmtoll ADC3R        ADC3TCC2        LL_HRTIM_ConfigADCTrig\n
  * @rmtoll ADC3R        ADC3TCC3        LL_HRTIM_ConfigADCTrig\n
  * @rmtoll ADC3R        ADC3TCC4        LL_HRTIM_ConfigADCTrig\n
  * @rmtoll ADC3R        ADC3TCPER       LL_HRTIM_ConfigADCTrig\n
  * @rmtoll ADC3R        ADC3TDC2        LL_HRTIM_ConfigADCTrig\n
  * @rmtoll ADC3R        ADC3TDC3        LL_HRTIM_ConfigADCTrig\n
  * @rmtoll ADC3R        ADC3TDC4        LL_HRTIM_ConfigADCTrig\n
  * @rmtoll ADC3R        ADC3TDPER       LL_HRTIM_ConfigADCTrig\n
  * @rmtoll ADC3R        ADC3TEC2        LL_HRTIM_ConfigADCTrig\n
  * @rmtoll ADC3R        ADC3TEC3        LL_HRTIM_ConfigADCTrig\n
  * @rmtoll ADC3R        ADC3TEC4        LL_HRTIM_ConfigADCTrig\n
  * @rmtoll ADC3R        ADC3TEPER       LL_HRTIM_ConfigADCTrig\n
  * @rmtoll ADC4R        ADC4MC1         LL_HRTIM_ConfigADCTrig\n
  * @rmtoll ADC4R        ADC4MC2         LL_HRTIM_ConfigADCTrig\n
  * @rmtoll ADC4R        ADC4MC3         LL_HRTIM_ConfigADCTrig\n
  * @rmtoll ADC4R        ADC4MC4         LL_HRTIM_ConfigADCTrig\n
  * @rmtoll ADC4R        ADC4MPER        LL_HRTIM_ConfigADCTrig\n
  * @rmtoll ADC4R        ADC4EEV6        LL_HRTIM_ConfigADCTrig\n
  * @rmtoll ADC4R        ADC4EEV7        LL_HRTIM_ConfigADCTrig\n
  * @rmtoll ADC4R        ADC4EEV8        LL_HRTIM_ConfigADCTrig\n
  * @rmtoll ADC4R        ADC4EEV9        LL_HRTIM_ConfigADCTrig\n
  * @rmtoll ADC4R        ADC4EEV10       LL_HRTIM_ConfigADCTrig\n
  * @rmtoll ADC4R        ADC4TAC2        LL_HRTIM_ConfigADCTrig\n
  * @rmtoll ADC4R        ADC4TAC3        LL_HRTIM_ConfigADCTrig\n
  * @rmtoll ADC4R        ADC4TAC4        LL_HRTIM_ConfigADCTrig\n
  * @rmtoll ADC4R        ADC4TAPER       LL_HRTIM_ConfigADCTrig\n
  * @rmtoll ADC4R        ADC4TBC2        LL_HRTIM_ConfigADCTrig\n
  * @rmtoll ADC4R        ADC4TBC3        LL_HRTIM_ConfigADCTrig\n
  * @rmtoll ADC4R        ADC4TBC4        LL_HRTIM_ConfigADCTrig\n
  * @rmtoll ADC4R        ADC4TBPER       LL_HRTIM_ConfigADCTrig\n
  * @rmtoll ADC4R        ADC4TCC2        LL_HRTIM_ConfigADCTrig\n
  * @rmtoll ADC4R        ADC4TCC3        LL_HRTIM_ConfigADCTrig\n
  * @rmtoll ADC4R        ADC4TCC4        LL_HRTIM_ConfigADCTrig\n
  * @rmtoll ADC4R        ADC4TCPER       LL_HRTIM_ConfigADCTrig\n
  * @rmtoll ADC4R        ADC4TCRST       LL_HRTIM_ConfigADCTrig\n
  * @rmtoll ADC4R        ADC4TDC2        LL_HRTIM_ConfigADCTrig\n
  * @rmtoll ADC4R        ADC4TDC3        LL_HRTIM_ConfigADCTrig\n
  * @rmtoll ADC4R        ADC4TDC4        LL_HRTIM_ConfigADCTrig\n
  * @rmtoll ADC4R        ADC4TDPER       LL_HRTIM_ConfigADCTrig\n
  * @rmtoll ADC4R        ADC4TDRST       LL_HRTIM_ConfigADCTrig\n
  * @rmtoll ADC4R        ADC4TEC2        LL_HRTIM_ConfigADCTrig\n
  * @rmtoll ADC4R        ADC4TEC3        LL_HRTIM_ConfigADCTrig\n
  * @rmtoll ADC4R        ADC4TEC4        LL_HRTIM_ConfigADCTrig\n
  * @rmtoll ADC4R        ADC4TERST       LL_HRTIM_ConfigADCTrig
  * @param  HRTIMx High Resolution Timer instance
  * @param  ADCTrig This parameter can be one of the following values:
  *         @arg @ref LL_HRTIM_ADCTRIG_1
  *         @arg @ref LL_HRTIM_ADCTRIG_2
  *         @arg @ref LL_HRTIM_ADCTRIG_3
  *         @arg @ref LL_HRTIM_ADCTRIG_4
  * @param  Update This parameter can be one of the following values:
  *         @arg @ref LL_HRTIM_ADCTRIG_UPDATE_MASTER
  *         @arg @ref LL_HRTIM_ADCTRIG_UPDATE_TIMER_A
  *         @arg @ref LL_HRTIM_ADCTRIG_UPDATE_TIMER_B
  *         @arg @ref LL_HRTIM_ADCTRIG_UPDATE_TIMER_C
  *         @arg @ref LL_HRTIM_ADCTRIG_UPDATE_TIMER_D
  *         @arg @ref LL_HRTIM_ADCTRIG_UPDATE_TIMER_E
  * @param  Src This parameter can be a combination of the following values:
  *
  *         For ADC trigger 1 and ADC trigger 3:
  *         @arg @ref LL_HRTIM_ADCTRIG_SRC13_NONE
  *         @arg @ref LL_HRTIM_ADCTRIG_SRC13_MCMP1
  *         @arg @ref LL_HRTIM_ADCTRIG_SRC13_MCMP2
  *         @arg @ref LL_HRTIM_ADCTRIG_SRC13_MCMP3
  *         @arg @ref LL_HRTIM_ADCTRIG_SRC13_MCMP4
  *         @arg @ref LL_HRTIM_ADCTRIG_SRC13_MPER
  *         @arg @ref LL_HRTIM_ADCTRIG_SRC13_TIMACMP2
  *         @arg @ref LL_HRTIM_ADCTRIG_SRC13_TIMACMP3
  *         @arg @ref LL_HRTIM_ADCTRIG_SRC13_TIMACMP4
  *         @arg @ref LL_HRTIM_ADCTRIG_SRC13_TIMAPER
  *         @arg @ref LL_HRTIM_ADCTRIG_SRC13_EEV1
  *         @arg @ref LL_HRTIM_ADCTRIG_SRC13_EEV2
  *         @arg @ref LL_HRTIM_ADCTRIG_SRC13_EEV3
  *         @arg @ref LL_HRTIM_ADCTRIG_SRC13_EEV4
  *         @arg @ref LL_HRTIM_ADCTRIG_SRC13_EEV5
  *         @arg @ref LL_HRTIM_ADCTRIG_SRC13_TIMARST
  *         @arg @ref LL_HRTIM_ADCTRIG_SRC13_TIMBCMP2
  *         @arg @ref LL_HRTIM_ADCTRIG_SRC13_TIMBCMP3
  *         @arg @ref LL_HRTIM_ADCTRIG_SRC13_TIMBCMP4
  *         @arg @ref LL_HRTIM_ADCTRIG_SRC13_TIMBPER
  *         @arg @ref LL_HRTIM_ADCTRIG_SRC13_TIMBRST
  *         @arg @ref LL_HRTIM_ADCTRIG_SRC13_TIMCCMP2
  *         @arg @ref LL_HRTIM_ADCTRIG_SRC13_TIMCCMP3
  *         @arg @ref LL_HRTIM_ADCTRIG_SRC13_TIMCCMP4
  *         @arg @ref LL_HRTIM_ADCTRIG_SRC13_TIMCPER
  *         @arg @ref LL_HRTIM_ADCTRIG_SRC13_TIMDCMP2
  *         @arg @ref LL_HRTIM_ADCTRIG_SRC13_TIMDCMP3
  *         @arg @ref LL_HRTIM_ADCTRIG_SRC13_TIMDCMP4
  *         @arg @ref LL_HRTIM_ADCTRIG_SRC13_TIMDPER
  *         @arg @ref LL_HRTIM_ADCTRIG_SRC13_TIMECMP2
  *         @arg @ref LL_HRTIM_ADCTRIG_SRC13_TIMECMP3
  *         @arg @ref LL_HRTIM_ADCTRIG_SRC13_TIMECMP4
  *         @arg @ref LL_HRTIM_ADCTRIG_SRC13_TIMEPER
  *
  *         For ADC trigger 2 and ADC trigger 4:
  *         @arg @ref LL_HRTIM_ADCTRIG_SRC24_NONE
  *         @arg @ref LL_HRTIM_ADCTRIG_SRC24_MCMP1
  *         @arg @ref LL_HRTIM_ADCTRIG_SRC24_MCMP2
  *         @arg @ref LL_HRTIM_ADCTRIG_SRC24_MCMP3
  *         @arg @ref LL_HRTIM_ADCTRIG_SRC24_MCMP4
  *         @arg @ref LL_HRTIM_ADCTRIG_SRC24_MPER
  *         @arg @ref LL_HRTIM_ADCTRIG_SRC24_EEV6
  *         @arg @ref LL_HRTIM_ADCTRIG_SRC24_EEV7
  *         @arg @ref LL_HRTIM_ADCTRIG_SRC24_EEV8
  *         @arg @ref LL_HRTIM_ADCTRIG_SRC24_EEV9
  *         @arg @ref LL_HRTIM_ADCTRIG_SRC24_EEV10
  *         @arg @ref LL_HRTIM_ADCTRIG_SRC24_TIMACMP2
  *         @arg @ref LL_HRTIM_ADCTRIG_SRC24_TIMACMP3
  *         @arg @ref LL_HRTIM_ADCTRIG_SRC24_TIMACMP4
  *         @arg @ref LL_HRTIM_ADCTRIG_SRC24_TIMAPER
  *         @arg @ref LL_HRTIM_ADCTRIG_SRC24_TIMBCMP2
  *         @arg @ref LL_HRTIM_ADCTRIG_SRC24_TIMBCMP3
  *         @arg @ref LL_HRTIM_ADCTRIG_SRC24_TIMBCMP4
  *         @arg @ref LL_HRTIM_ADCTRIG_SRC24_TIMBPER
  *         @arg @ref LL_HRTIM_ADCTRIG_SRC24_TIMCCMP2
  *         @arg @ref LL_HRTIM_ADCTRIG_SRC24_TIMCCMP3
  *         @arg @ref LL_HRTIM_ADCTRIG_SRC24_TIMCCMP4
  *         @arg @ref LL_HRTIM_ADCTRIG_SRC24_TIMCPER
  *         @arg @ref LL_HRTIM_ADCTRIG_SRC24_TIMCRST
  *         @arg @ref LL_HRTIM_ADCTRIG_SRC24_TIMDCMP2
  *         @arg @ref LL_HRTIM_ADCTRIG_SRC24_TIMDCMP3
  *         @arg @ref LL_HRTIM_ADCTRIG_SRC24_TIMDCMP4
  *         @arg @ref LL_HRTIM_ADCTRIG_SRC24_TIMDPER
  *         @arg @ref LL_HRTIM_ADCTRIG_SRC24_TIMDRST
  *         @arg @ref LL_HRTIM_ADCTRIG_SRC24_TIMECMP2
  *         @arg @ref LL_HRTIM_ADCTRIG_SRC24_TIMECMP3
  *         @arg @ref LL_HRTIM_ADCTRIG_SRC24_TIMECMP4
  *         @arg @ref LL_HRTIM_ADCTRIG_SRC24_TIMERST
  * @retval None
  */
__STATIC_INLINE void LL_HRTIM_ConfigADCTrig(HRTIM_TypeDef *HRTIMx, uint32_t ADCTrig, uint32_t Update, uint32_t Src)
{
  register uint32_t shift = 3 * ADCTrig;
  register uint32_t *pReg = (uint32_t *)((uint32_t)((uint32_t)(&HRTIMx->sCommonRegs.ADC1R) +
                                                    REG_OFFSET_TAB_ADCxR[ADCTrig]));
  MODIFY_REG(HRTIMx->sCommonRegs.CR1, (HRTIM_CR1_ADC1USRC << shift), (Update << shift));
  WRITE_REG(*pReg, Src);
}

/**
  * @brief  Associate the ADCx trigger to a timer triggering the update of the HRTIM_ADCxR register.
  * @rmtoll CR1          ADC1USRC         LL_HRTIM_SetADCTrigUpdate\n
  * @rmtoll CR1          ADC2USRC         LL_HRTIM_SetADCTrigUpdate\n
  * @rmtoll CR1          ADC3USRC         LL_HRTIM_SetADCTrigUpdate\n
  * @rmtoll CR1          ADC4USRC         LL_HRTIM_SetADCTrigUpdate
  * @note When the preload is disabled in the source timer, the HRTIM_ADCxR
  *       registers are not preloaded either: a write access will result in an
  *       immediate update of the trigger source.
  * @param  HRTIMx High Resolution Timer instance
  * @param  ADCTrig This parameter can be one of the following values:
  *         @arg @ref LL_HRTIM_ADCTRIG_1
  *         @arg @ref LL_HRTIM_ADCTRIG_2
  *         @arg @ref LL_HRTIM_ADCTRIG_3
  *         @arg @ref LL_HRTIM_ADCTRIG_4
  * @param  Update This parameter can be one of the following values:
  *         @arg @ref LL_HRTIM_ADCTRIG_UPDATE_MASTER
  *         @arg @ref LL_HRTIM_ADCTRIG_UPDATE_TIMER_A
  *         @arg @ref LL_HRTIM_ADCTRIG_UPDATE_TIMER_B
  *         @arg @ref LL_HRTIM_ADCTRIG_UPDATE_TIMER_C
  *         @arg @ref LL_HRTIM_ADCTRIG_UPDATE_TIMER_D
  *         @arg @ref LL_HRTIM_ADCTRIG_UPDATE_TIMER_E
  * @retval None
  */
__STATIC_INLINE void LL_HRTIM_SetADCTrigUpdate(HRTIM_TypeDef *HRTIMx, uint32_t ADCTrig, uint32_t Update)
{
  register uint32_t shift = 3 * ADCTrig;
  MODIFY_REG(HRTIMx->sCommonRegs.CR1, (HRTIM_CR1_ADC1USRC << shift), (Update << shift));
}

/**
  * @brief  Get the source timer triggering the update of the HRTIM_ADCxR register.
  * @rmtoll CR1          ADC1USRC        LL_HRTIM_GetADCTrigUpdate\n
  * @rmtoll CR1          ADC2USRC        LL_HRTIM_GetADCTrigUpdate\n
  * @rmtoll CR1          ADC3USRC        LL_HRTIM_GetADCTrigUpdate\n
  * @rmtoll CR1          ADC4USRC        LL_HRTIM_GetADCTrigUpdate
  * @param  HRTIMx High Resolution Timer instance
  * @param  ADCTrig This parameter can be one of the following values:
  *         @arg @ref LL_HRTIM_ADCTRIG_1
  *         @arg @ref LL_HRTIM_ADCTRIG_2
  *         @arg @ref LL_HRTIM_ADCTRIG_3
  *         @arg @ref LL_HRTIM_ADCTRIG_4
  * @retval Update Returned value can be one of the following values:
  *         @arg @ref LL_HRTIM_ADCTRIG_UPDATE_MASTER
  *         @arg @ref LL_HRTIM_ADCTRIG_UPDATE_TIMER_A
  *         @arg @ref LL_HRTIM_ADCTRIG_UPDATE_TIMER_B
  *         @arg @ref LL_HRTIM_ADCTRIG_UPDATE_TIMER_C
  *         @arg @ref LL_HRTIM_ADCTRIG_UPDATE_TIMER_D
  *         @arg @ref LL_HRTIM_ADCTRIG_UPDATE_TIMER_E
  */
__STATIC_INLINE uint32_t LL_HRTIM_GetADCTrigUpdate(HRTIM_TypeDef *HRTIMx, uint32_t ADCTrig)
{
  register uint32_t shift = 3 * ADCTrig;
  return (READ_BIT(HRTIMx->sCommonRegs.CR1, (HRTIM_CR1_ADC1USRC << shift)) >> shift);
}

