zephyrproject-rtos/zephyr/ext/hal/st/stm32cube/stm32f3xx/drivers/include/stm32f3xx_ll_hrtim.h
/**
  * @brief  Indicate which events (timer events and/or external events) are currently used as triggers for ADC conversion.
  * @rmtoll ADC1R        ADC1MC4         LL_HRTIM_GetADCTrigSrc\n
  * @rmtoll ADC1R        ADC1MPER        LL_HRTIM_GetADCTrigSrc\n
  * @rmtoll ADC1R        ADC1EEV1        LL_HRTIM_GetADCTrigSrc\n
  * @rmtoll ADC1R        ADC1EEV2        LL_HRTIM_GetADCTrigSrc\n
  * @rmtoll ADC1R        ADC1EEV3        LL_HRTIM_GetADCTrigSrc\n
  * @rmtoll ADC1R        ADC1EEV4        LL_HRTIM_GetADCTrigSrc\n
  * @rmtoll ADC1R        ADC1EEV5        LL_HRTIM_GetADCTrigSrc\n
  * @rmtoll ADC1R        ADC1TAC2        LL_HRTIM_GetADCTrigSrc\n
  * @rmtoll ADC1R        ADC1TAC3        LL_HRTIM_GetADCTrigSrc\n
  * @rmtoll ADC1R        ADC1TAC4        LL_HRTIM_GetADCTrigSrc\n
  * @rmtoll ADC1R        ADC1TAPER       LL_HRTIM_GetADCTrigSrc\n
  * @rmtoll ADC1R        ADC1TARST       LL_HRTIM_GetADCTrigSrc\n
  * @rmtoll ADC1R        ADC1TBC2        LL_HRTIM_GetADCTrigSrc\n
  * @rmtoll ADC1R        ADC1TBC3        LL_HRTIM_GetADCTrigSrc\n
  * @rmtoll ADC1R        ADC1TBC4        LL_HRTIM_GetADCTrigSrc\n
  * @rmtoll ADC1R        ADC1TBPER       LL_HRTIM_GetADCTrigSrc\n
  * @rmtoll ADC1R        ADC1TBRST       LL_HRTIM_GetADCTrigSrc\n
  * @rmtoll ADC1R        ADC1TCC2        LL_HRTIM_GetADCTrigSrc\n
  * @rmtoll ADC1R        ADC1TCC3        LL_HRTIM_GetADCTrigSrc\n
  * @rmtoll ADC1R        ADC1TCC4        LL_HRTIM_GetADCTrigSrc\n
  * @rmtoll ADC1R        ADC1TCPER       LL_HRTIM_GetADCTrigSrc\n
  * @rmtoll ADC1R        ADC1TDC2        LL_HRTIM_GetADCTrigSrc\n
  * @rmtoll ADC1R        ADC1TDC3        LL_HRTIM_GetADCTrigSrc\n
  * @rmtoll ADC1R        ADC1TDC4        LL_HRTIM_GetADCTrigSrc\n
  * @rmtoll ADC1R        ADC1TDPER       LL_HRTIM_GetADCTrigSrc\n
  * @rmtoll ADC1R        ADC1TEC2        LL_HRTIM_GetADCTrigSrc\n
  * @rmtoll ADC1R        ADC1TEC3        LL_HRTIM_GetADCTrigSrc\n
  * @rmtoll ADC1R        ADC1TEC4        LL_HRTIM_GetADCTrigSrc\n
  * @rmtoll ADC1R        ADC1TEPER       LL_HRTIM_GetADCTrigSrc\n
  * @rmtoll ADC2R        ADC2MC1         LL_HRTIM_GetADCTrigSrc\n
  * @rmtoll ADC2R        ADC2MC2         LL_HRTIM_GetADCTrigSrc\n
  * @rmtoll ADC2R        ADC2MC3         LL_HRTIM_GetADCTrigSrc\n
  * @rmtoll ADC2R        ADC2MC4         LL_HRTIM_GetADCTrigSrc\n
  * @rmtoll ADC2R        ADC2MPER        LL_HRTIM_GetADCTrigSrc\n
  * @rmtoll ADC2R        ADC2EEV6        LL_HRTIM_GetADCTrigSrc\n
  * @rmtoll ADC2R        ADC2EEV7        LL_HRTIM_GetADCTrigSrc\n
  * @rmtoll ADC2R        ADC2EEV8        LL_HRTIM_GetADCTrigSrc\n
  * @rmtoll ADC2R        ADC2EEV9        LL_HRTIM_GetADCTrigSrc\n
  * @rmtoll ADC2R        ADC2EEV10       LL_HRTIM_GetADCTrigSrc\n
  * @rmtoll ADC2R        ADC2TAC2        LL_HRTIM_GetADCTrigSrc\n
  * @rmtoll ADC2R        ADC2TAC3        LL_HRTIM_GetADCTrigSrc\n
  * @rmtoll ADC2R        ADC2TAC4        LL_HRTIM_GetADCTrigSrc\n
  * @rmtoll ADC2R        ADC2TAPER       LL_HRTIM_GetADCTrigSrc\n
  * @rmtoll ADC2R        ADC2TBC2        LL_HRTIM_GetADCTrigSrc\n
  * @rmtoll ADC2R        ADC2TBC3        LL_HRTIM_GetADCTrigSrc\n
  * @rmtoll ADC2R        ADC2TBC4        LL_HRTIM_GetADCTrigSrc\n
  * @rmtoll ADC2R        ADC2TBPER       LL_HRTIM_GetADCTrigSrc\n
  * @rmtoll ADC2R        ADC2TCC2        LL_HRTIM_GetADCTrigSrc\n
  * @rmtoll ADC2R        ADC2TCC3        LL_HRTIM_GetADCTrigSrc\n
  * @rmtoll ADC2R        ADC2TCC4        LL_HRTIM_GetADCTrigSrc\n
  * @rmtoll ADC2R        ADC2TCPER       LL_HRTIM_GetADCTrigSrc\n
  * @rmtoll ADC2R        ADC2TCRST       LL_HRTIM_GetADCTrigSrc\n
  * @rmtoll ADC2R        ADC2TDC2        LL_HRTIM_GetADCTrigSrc\n
  * @rmtoll ADC2R        ADC2TDC3        LL_HRTIM_GetADCTrigSrc\n
  * @rmtoll ADC2R        ADC2TDC4        LL_HRTIM_GetADCTrigSrc\n
  * @rmtoll ADC2R        ADC2TDPER       LL_HRTIM_GetADCTrigSrc\n
  * @rmtoll ADC2R        ADC2TDRST       LL_HRTIM_GetADCTrigSrc\n
  * @rmtoll ADC2R        ADC2TEC2        LL_HRTIM_GetADCTrigSrc\n
  * @rmtoll ADC2R        ADC2TEC3        LL_HRTIM_GetADCTrigSrc\n
  * @rmtoll ADC2R        ADC2TEC4        LL_HRTIM_GetADCTrigSrc\n
  * @rmtoll ADC2R        ADC2TERST       LL_HRTIM_GetADCTrigSrc\n
  * @rmtoll ADC3R        ADC3MC1         LL_HRTIM_GetADCTrigSrc\n
  * @rmtoll ADC3R        ADC3MC2         LL_HRTIM_GetADCTrigSrc\n
  * @rmtoll ADC3R        ADC3MC3         LL_HRTIM_GetADCTrigSrc\n
  * @rmtoll ADC3R        ADC3MC4         LL_HRTIM_GetADCTrigSrc\n
  * @rmtoll ADC3R        ADC3MPER        LL_HRTIM_GetADCTrigSrc\n
  * @rmtoll ADC3R        ADC3EEV1        LL_HRTIM_GetADCTrigSrc\n
  * @rmtoll ADC3R        ADC3EEV2        LL_HRTIM_GetADCTrigSrc\n
  * @rmtoll ADC3R        ADC3EEV3        LL_HRTIM_GetADCTrigSrc\n
  * @rmtoll ADC3R        ADC3EEV4        LL_HRTIM_GetADCTrigSrc\n
  * @rmtoll ADC3R        ADC3EEV5        LL_HRTIM_GetADCTrigSrc\n
  * @rmtoll ADC3R        ADC3TAC2        LL_HRTIM_GetADCTrigSrc\n
  * @rmtoll ADC3R        ADC3TAC3        LL_HRTIM_GetADCTrigSrc\n
  * @rmtoll ADC3R        ADC3TAC4        LL_HRTIM_GetADCTrigSrc\n
  * @rmtoll ADC3R        ADC3TAPER       LL_HRTIM_GetADCTrigSrc\n
  * @rmtoll ADC3R        ADC3TARST       LL_HRTIM_GetADCTrigSrc\n
  * @rmtoll ADC3R        ADC3TBC2        LL_HRTIM_GetADCTrigSrc\n
  * @rmtoll ADC3R        ADC3TBC3        LL_HRTIM_GetADCTrigSrc\n
  * @rmtoll ADC3R        ADC3TBC4        LL_HRTIM_GetADCTrigSrc\n
  * @rmtoll ADC3R        ADC3TBPER       LL_HRTIM_GetADCTrigSrc\n
  * @rmtoll ADC3R        ADC3TBRST       LL_HRTIM_GetADCTrigSrc\n
  * @rmtoll ADC3R        ADC3TCC2        LL_HRTIM_GetADCTrigSrc\n
  * @rmtoll ADC3R        ADC3TCC3        LL_HRTIM_GetADCTrigSrc\n
  * @rmtoll ADC3R        ADC3TCC4        LL_HRTIM_GetADCTrigSrc\n
  * @rmtoll ADC3R        ADC3TCPER       LL_HRTIM_GetADCTrigSrc\n
  * @rmtoll ADC3R        ADC3TDC2        LL_HRTIM_GetADCTrigSrc\n
  * @rmtoll ADC3R        ADC3TDC3        LL_HRTIM_GetADCTrigSrc\n
  * @rmtoll ADC3R        ADC3TDC4        LL_HRTIM_GetADCTrigSrc\n
  * @rmtoll ADC3R        ADC3TDPER       LL_HRTIM_GetADCTrigSrc\n
  * @rmtoll ADC3R        ADC3TEC2        LL_HRTIM_GetADCTrigSrc\n
  * @rmtoll ADC3R        ADC3TEC3        LL_HRTIM_GetADCTrigSrc\n
  * @rmtoll ADC3R        ADC3TEC4        LL_HRTIM_GetADCTrigSrc\n
  * @rmtoll ADC3R        ADC3TEPER       LL_HRTIM_GetADCTrigSrc\n
  * @rmtoll ADC4R        ADC4MC1         LL_HRTIM_GetADCTrigSrc\n
  * @rmtoll ADC4R        ADC4MC2         LL_HRTIM_GetADCTrigSrc\n
  * @rmtoll ADC4R        ADC4MC3         LL_HRTIM_GetADCTrigSrc\n
  * @rmtoll ADC4R        ADC4MC4         LL_HRTIM_GetADCTrigSrc\n
  * @rmtoll ADC4R        ADC4MPER        LL_HRTIM_GetADCTrigSrc\n
  * @rmtoll ADC4R        ADC4EEV6        LL_HRTIM_GetADCTrigSrc\n
  * @rmtoll ADC4R        ADC4EEV7        LL_HRTIM_GetADCTrigSrc\n
  * @rmtoll ADC4R        ADC4EEV8        LL_HRTIM_GetADCTrigSrc\n
  * @rmtoll ADC4R        ADC4EEV9        LL_HRTIM_GetADCTrigSrc\n
  * @rmtoll ADC4R        ADC4EEV10       LL_HRTIM_GetADCTrigSrc\n
  * @rmtoll ADC4R        ADC4TAC2        LL_HRTIM_GetADCTrigSrc\n
  * @rmtoll ADC4R        ADC4TAC3        LL_HRTIM_GetADCTrigSrc\n
  * @rmtoll ADC4R        ADC4TAC4        LL_HRTIM_GetADCTrigSrc\n
  * @rmtoll ADC4R        ADC4TAPER       LL_HRTIM_GetADCTrigSrc\n
  * @rmtoll ADC4R        ADC4TBC2        LL_HRTIM_GetADCTrigSrc\n
  * @rmtoll ADC4R        ADC4TBC3        LL_HRTIM_GetADCTrigSrc\n
  * @rmtoll ADC4R        ADC4TBC4        LL_HRTIM_GetADCTrigSrc\n
  * @rmtoll ADC4R        ADC4TBPER       LL_HRTIM_GetADCTrigSrc\n
  * @rmtoll ADC4R        ADC4TCC2        LL_HRTIM_GetADCTrigSrc\n
  * @rmtoll ADC4R        ADC4TCC3        LL_HRTIM_GetADCTrigSrc\n
  * @rmtoll ADC4R        ADC4TCC4        LL_HRTIM_GetADCTrigSrc\n
  * @rmtoll ADC4R        ADC4TCPER       LL_HRTIM_GetADCTrigSrc\n
  * @rmtoll ADC4R        ADC4TCRST       LL_HRTIM_GetADCTrigSrc\n
  * @rmtoll ADC4R        ADC4TDC2        LL_HRTIM_GetADCTrigSrc\n
  * @rmtoll ADC4R        ADC4TDC3        LL_HRTIM_GetADCTrigSrc\n
  * @rmtoll ADC4R        ADC4TDC4        LL_HRTIM_GetADCTrigSrc\n
  * @rmtoll ADC4R        ADC4TDPER       LL_HRTIM_GetADCTrigSrc\n
  * @rmtoll ADC4R        ADC4TDRST       LL_HRTIM_GetADCTrigSrc\n
  * @rmtoll ADC4R        ADC4TEC2        LL_HRTIM_GetADCTrigSrc\n
  * @rmtoll ADC4R        ADC4TEC3        LL_HRTIM_GetADCTrigSrc\n
  * @rmtoll ADC4R        ADC4TEC4        LL_HRTIM_GetADCTrigSrc\n
  * @rmtoll ADC4R        ADC4TERST       LL_HRTIM_GetADCTrigSrc
  * @param  HRTIMx High Resolution Timer instance
  * @param  ADCTrig This parameter can be one of the following values:
  *         @arg @ref LL_HRTIM_ADCTRIG_1
  *         @arg @ref LL_HRTIM_ADCTRIG_2
  *         @arg @ref LL_HRTIM_ADCTRIG_3
  *         @arg @ref LL_HRTIM_ADCTRIG_4
  * @retval Src This parameter can be a combination of the following values:
  *
  *         For ADC trigger 1 and ADC trigger 3:
  *         @arg @ref LL_HRTIM_ADCTRIG_SRC13_NONE
  *         @arg @ref LL_HRTIM_ADCTRIG_SRC13_MCMP1
  *         @arg @ref LL_HRTIM_ADCTRIG_SRC13_MCMP2
  *         @arg @ref LL_HRTIM_ADCTRIG_SRC13_MCMP3
  *         @arg @ref LL_HRTIM_ADCTRIG_SRC13_MCMP4
  *         @arg @ref LL_HRTIM_ADCTRIG_SRC13_MPER
  *         @arg @ref LL_HRTIM_ADCTRIG_SRC13_TIMACMP2
  *         @arg @ref LL_HRTIM_ADCTRIG_SRC13_TIMACMP3
  *         @arg @ref LL_HRTIM_ADCTRIG_SRC13_TIMACMP4
  *         @arg @ref LL_HRTIM_ADCTRIG_SRC13_TIMAPER
  *         @arg @ref LL_HRTIM_ADCTRIG_SRC13_EEV1
  *         @arg @ref LL_HRTIM_ADCTRIG_SRC13_EEV2
  *         @arg @ref LL_HRTIM_ADCTRIG_SRC13_EEV3
  *         @arg @ref LL_HRTIM_ADCTRIG_SRC13_EEV4
  *         @arg @ref LL_HRTIM_ADCTRIG_SRC13_EEV5
  *         @arg @ref LL_HRTIM_ADCTRIG_SRC13_TIMARST
  *         @arg @ref LL_HRTIM_ADCTRIG_SRC13_TIMBCMP2
  *         @arg @ref LL_HRTIM_ADCTRIG_SRC13_TIMBCMP3
  *         @arg @ref LL_HRTIM_ADCTRIG_SRC13_TIMBCMP4
  *         @arg @ref LL_HRTIM_ADCTRIG_SRC13_TIMBPER
  *         @arg @ref LL_HRTIM_ADCTRIG_SRC13_TIMBRST
  *         @arg @ref LL_HRTIM_ADCTRIG_SRC13_TIMCCMP2
  *         @arg @ref LL_HRTIM_ADCTRIG_SRC13_TIMCCMP3
  *         @arg @ref LL_HRTIM_ADCTRIG_SRC13_TIMCCMP4
  *         @arg @ref LL_HRTIM_ADCTRIG_SRC13_TIMCPER
  *         @arg @ref LL_HRTIM_ADCTRIG_SRC13_TIMDCMP2
  *         @arg @ref LL_HRTIM_ADCTRIG_SRC13_TIMDCMP3
  *         @arg @ref LL_HRTIM_ADCTRIG_SRC13_TIMDCMP4
  *         @arg @ref LL_HRTIM_ADCTRIG_SRC13_TIMDPER
  *         @arg @ref LL_HRTIM_ADCTRIG_SRC13_TIMECMP2
  *         @arg @ref LL_HRTIM_ADCTRIG_SRC13_TIMECMP3
  *         @arg @ref LL_HRTIM_ADCTRIG_SRC13_TIMECMP4
  *         @arg @ref LL_HRTIM_ADCTRIG_SRC13_TIMEPER
  *
  *         For ADC trigger 2 and ADC trigger 4:
  *         @arg @ref LL_HRTIM_ADCTRIG_SRC24_NONE
  *         @arg @ref LL_HRTIM_ADCTRIG_SRC24_MCMP1
  *         @arg @ref LL_HRTIM_ADCTRIG_SRC24_MCMP2
  *         @arg @ref LL_HRTIM_ADCTRIG_SRC24_MCMP3
  *         @arg @ref LL_HRTIM_ADCTRIG_SRC24_MCMP4
  *         @arg @ref LL_HRTIM_ADCTRIG_SRC24_MPER
  *         @arg @ref LL_HRTIM_ADCTRIG_SRC24_EEV6
  *         @arg @ref LL_HRTIM_ADCTRIG_SRC24_EEV7
  *         @arg @ref LL_HRTIM_ADCTRIG_SRC24_EEV8
  *         @arg @ref LL_HRTIM_ADCTRIG_SRC24_EEV9
  *         @arg @ref LL_HRTIM_ADCTRIG_SRC24_EEV10
  *         @arg @ref LL_HRTIM_ADCTRIG_SRC24_TIMACMP2
  *         @arg @ref LL_HRTIM_ADCTRIG_SRC24_TIMACMP3
  *         @arg @ref LL_HRTIM_ADCTRIG_SRC24_TIMACMP4
  *         @arg @ref LL_HRTIM_ADCTRIG_SRC24_TIMAPER
  *         @arg @ref LL_HRTIM_ADCTRIG_SRC24_TIMBCMP2
  *         @arg @ref LL_HRTIM_ADCTRIG_SRC24_TIMBCMP3
  *         @arg @ref LL_HRTIM_ADCTRIG_SRC24_TIMBCMP4
  *         @arg @ref LL_HRTIM_ADCTRIG_SRC24_TIMBPER
  *         @arg @ref LL_HRTIM_ADCTRIG_SRC24_TIMCCMP2
  *         @arg @ref LL_HRTIM_ADCTRIG_SRC24_TIMCCMP3
  *         @arg @ref LL_HRTIM_ADCTRIG_SRC24_TIMCCMP4
  *         @arg @ref LL_HRTIM_ADCTRIG_SRC24_TIMCPER
  *         @arg @ref LL_HRTIM_ADCTRIG_SRC24_TIMCRST
  *         @arg @ref LL_HRTIM_ADCTRIG_SRC24_TIMDCMP2
  *         @arg @ref LL_HRTIM_ADCTRIG_SRC24_TIMDCMP3
  *         @arg @ref LL_HRTIM_ADCTRIG_SRC24_TIMDCMP4
  *         @arg @ref LL_HRTIM_ADCTRIG_SRC24_TIMDPER
  *         @arg @ref LL_HRTIM_ADCTRIG_SRC24_TIMDRST
  *         @arg @ref LL_HRTIM_ADCTRIG_SRC24_TIMECMP2
  *         @arg @ref LL_HRTIM_ADCTRIG_SRC24_TIMECMP3
  *         @arg @ref LL_HRTIM_ADCTRIG_SRC24_TIMECMP4
  *         @arg @ref LL_HRTIM_ADCTRIG_SRC24_TIMERST
  */
__STATIC_INLINE uint32_t LL_HRTIM_GetADCTrigSrc(HRTIM_TypeDef *HRTIMx, uint32_t ADCTrig)
{
  register uint32_t *pReg = (uint32_t *)((uint32_t)((uint32_t)(&HRTIMx->sCommonRegs.ADC1R) +
                                                    REG_OFFSET_TAB_ADCxR[ADCTrig]));
  return (*pReg);
}

/**
  * @brief  Configure the DLL calibration mode.
  * @rmtoll DLLCR        CALEN         LL_HRTIM_ConfigDLLCalibration\n
  * @rmtoll DLLCR        CALRTE        LL_HRTIM_ConfigDLLCalibration
  * @param  HRTIMx High Resolution Timer instance
  * @param  Mode This parameter can be one of the following values:
  *         @arg @ref LL_HRTIM_DLLCALIBRATION_MODE_SINGLESHOT
  *         @arg @ref LL_HRTIM_DLLCALIBRATION_MODE_CONTINUOUS
   * @param  Period This parameter can be one of the following values:
  *         @arg @ref LL_HRTIM_DLLCALIBRATION_RATE_7300
  *         @arg @ref LL_HRTIM_DLLCALIBRATION_RATE_910
  *         @arg @ref LL_HRTIM_DLLCALIBRATION_RATE_114
  *         @arg @ref LL_HRTIM_DLLCALIBRATION_RATE_14
 * @retval None
  */
__STATIC_INLINE void LL_HRTIM_ConfigDLLCalibration(HRTIM_TypeDef *HRTIMx, uint32_t Mode, uint32_t Period)
{
  MODIFY_REG(HRTIMx->sCommonRegs.DLLCR, (HRTIM_DLLCR_CALEN | HRTIM_DLLCR_CALRTE), (Mode | Period));
}

/**
  * @brief  Launch DLL calibration
  * @rmtoll DLLCR        CAL           LL_HRTIM_StartDLLCalibration
  * @param  HRTIMx High Resolution Timer instance
  * @retval None
  */
__STATIC_INLINE void LL_HRTIM_StartDLLCalibration(HRTIM_TypeDef *HRTIMx)
{
  SET_BIT(HRTIMx->sCommonRegs.DLLCR, HRTIM_DLLCR_CAL);
}

/**
  * @}
  */

/** @defgroup HRTIM_EF_HRTIM_Timer_Control HRTIM_Timer_Control
  * @{
  */

/**
  * @brief  Enable timer(s) counter.
  * @rmtoll MDIER        TECEN         LL_HRTIM_TIM_CounterEnable\n
  *         MDIER        TDCEN         LL_HRTIM_TIM_CounterEnable\n
  *         MDIER        TCCEN         LL_HRTIM_TIM_CounterEnable\n
  *         MDIER        TBCEN         LL_HRTIM_TIM_CounterEnable\n
  *         MDIER        TACEN         LL_HRTIM_TIM_CounterEnable\n
  *         MDIER        MCEN          LL_HRTIM_TIM_CounterEnable
  * @param  HRTIMx High Resolution Timer instance
  * @param  Timers This parameter can be a combination of the following values:
  *         @arg @ref LL_HRTIM_TIMER_MASTER
  *         @arg @ref LL_HRTIM_TIMER_A
  *         @arg @ref LL_HRTIM_TIMER_B
  *         @arg @ref LL_HRTIM_TIMER_C
  *         @arg @ref LL_HRTIM_TIMER_D
  *         @arg @ref LL_HRTIM_TIMER_E
  * @retval None
  */
__STATIC_INLINE void LL_HRTIM_TIM_CounterEnable(HRTIM_TypeDef *HRTIMx, uint32_t Timers)
{
  SET_BIT(HRTIMx->sMasterRegs.MCR, Timers);
}

/**
  * @brief  Disable timer(s) counter.
  * @rmtoll MDIER        TECEN         LL_HRTIM_TIM_CounterDisable\n
  *         MDIER        TDCEN         LL_HRTIM_TIM_CounterDisable\n
  *         MDIER        TCCEN         LL_HRTIM_TIM_CounterDisable\n
  *         MDIER        TBCEN         LL_HRTIM_TIM_CounterDisable\n
  *         MDIER        TACEN         LL_HRTIM_TIM_CounterDisable\n
  *         MDIER        MCEN          LL_HRTIM_TIM_CounterDisable
  * @param  HRTIMx High Resolution Timer instance
  * @param  Timers This parameter can be a combination of the following values:
  *         @arg @ref LL_HRTIM_TIMER_MASTER
  *         @arg @ref LL_HRTIM_TIMER_A
  *         @arg @ref LL_HRTIM_TIMER_B
  *         @arg @ref LL_HRTIM_TIMER_C
  *         @arg @ref LL_HRTIM_TIMER_D
  *         @arg @ref LL_HRTIM_TIMER_E
  * @retval None
  */
__STATIC_INLINE void LL_HRTIM_TIM_CounterDisable(HRTIM_TypeDef *HRTIMx, uint32_t Timers)
{
  CLEAR_BIT(HRTIMx->sMasterRegs.MCR, Timers);
}

/**
  * @brief  Indicate whether the timer counter is enabled.
  * @rmtoll MDIER        TECEN         LL_HRTIM_TIM_IsCounterEnabled\n
  *         MDIER        TDCEN         LL_HRTIM_TIM_IsCounterEnabled\n
  *         MDIER        TCCEN         LL_HRTIM_TIM_IsCounterEnabled\n
  *         MDIER        TBCEN         LL_HRTIM_TIM_IsCounterEnabled\n
  *         MDIER        TACEN         LL_HRTIM_TIM_IsCounterEnabled\n
  *         MDIER        MCEN          LL_HRTIM_TIM_IsCounterEnabled
  * @param  HRTIMx High Resolution Timer instance
  * @param  Timer This parameter can be one of the following values:
  *         @arg @ref LL_HRTIM_TIMER_MASTER
  *         @arg @ref LL_HRTIM_TIMER_A
  *         @arg @ref LL_HRTIM_TIMER_B
  *         @arg @ref LL_HRTIM_TIMER_C
  *         @arg @ref LL_HRTIM_TIMER_D
  *         @arg @ref LL_HRTIM_TIMER_E
  * @retval State of MCEN or TxCEN bit HRTIM_MCR register (1 or 0).
  */
__STATIC_INLINE uint32_t LL_HRTIM_TIM_IsCounterEnabled(HRTIM_TypeDef *HRTIMx, uint32_t Timer)
{
  return (READ_BIT(HRTIMx->sMasterRegs.MCR, Timer) == (Timer));
}

/**
  * @brief  Set the timer clock prescaler ratio.
  * @rmtoll MCR        CKPSC         LL_HRTIM_TIM_SetPrescaler\n
  * @rmtoll TIMxCR     CKPSC         LL_HRTIM_TIM_SetPrescaler
  * @note The counter clock equivalent frequency (CK_CNT) is equal to fHRCK / 2^CKPSC[2:0].
  * @note The prescaling ratio cannot be modified once the timer counter is enabled.
  * @param  HRTIMx High Resolution Timer instance
  * @param  Timer This parameter can be one of the following values:
  *         @arg @ref LL_HRTIM_TIMER_MASTER
  *         @arg @ref LL_HRTIM_TIMER_A
  *         @arg @ref LL_HRTIM_TIMER_B
  *         @arg @ref LL_HRTIM_TIMER_C
  *         @arg @ref LL_HRTIM_TIMER_D
  *         @arg @ref LL_HRTIM_TIMER_E
  * @param  Prescaler This parameter can be one of the following values:
  *         @arg @ref LL_HRTIM_PRESCALERRATIO_MUL32
  *         @arg @ref LL_HRTIM_PRESCALERRATIO_MUL16
  *         @arg @ref LL_HRTIM_PRESCALERRATIO_MUL8
  *         @arg @ref LL_HRTIM_PRESCALERRATIO_MUL4
  *         @arg @ref LL_HRTIM_PRESCALERRATIO_MUL2
  *         @arg @ref LL_HRTIM_PRESCALERRATIO_DIV1
  *         @arg @ref LL_HRTIM_PRESCALERRATIO_DIV2
  *         @arg @ref LL_HRTIM_PRESCALERRATIO_DIV4
  * @retval None
  */
__STATIC_INLINE void LL_HRTIM_TIM_SetPrescaler(HRTIM_TypeDef *HRTIMx, uint32_t Timer, uint32_t Prescaler)
{
  register uint32_t iTimer = (uint8_t)(POSITION_VAL(Timer) - POSITION_VAL(HRTIM_MCR_MCEN));
  register uint32_t *pReg = (uint32_t *)((uint32_t)((uint32_t)(&HRTIMx->sMasterRegs.MCR) + REG_OFFSET_TAB_TIMER[iTimer]));
  MODIFY_REG(*pReg, HRTIM_MCR_CK_PSC, Prescaler);
}

/**
  * @brief  Get the timer clock prescaler ratio
  * @rmtoll MCR        CKPSC         LL_HRTIM_TIM_GetPrescaler\n
  * @rmtoll TIMxCR     CKPSC         LL_HRTIM_TIM_GetPrescaler
  * @param  HRTIMx High Resolution Timer instance
  * @param  Timer This parameter can be one of the following values:
  *         @arg @ref LL_HRTIM_TIMER_MASTER
  *         @arg @ref LL_HRTIM_TIMER_A
  *         @arg @ref LL_HRTIM_TIMER_B
  *         @arg @ref LL_HRTIM_TIMER_C
  *         @arg @ref LL_HRTIM_TIMER_D
  *         @arg @ref LL_HRTIM_TIMER_E
  * @retval Prescaler Returned value can be one of the following values:
  *         @arg @ref LL_HRTIM_PRESCALERRATIO_MUL32
  *         @arg @ref LL_HRTIM_PRESCALERRATIO_MUL16
  *         @arg @ref LL_HRTIM_PRESCALERRATIO_MUL8
  *         @arg @ref LL_HRTIM_PRESCALERRATIO_MUL4
  *         @arg @ref LL_HRTIM_PRESCALERRATIO_MUL2
  *         @arg @ref LL_HRTIM_PRESCALERRATIO_DIV1
  *         @arg @ref LL_HRTIM_PRESCALERRATIO_DIV2
  *         @arg @ref LL_HRTIM_PRESCALERRATIO_DIV4
  */
__STATIC_INLINE uint32_t LL_HRTIM_TIM_GetPrescaler(HRTIM_TypeDef *HRTIMx, uint32_t Timer)
{
  register uint32_t iTimer = (uint8_t)(POSITION_VAL(Timer) - POSITION_VAL(HRTIM_MCR_MCEN));
  register uint32_t *pReg = (uint32_t *)((uint32_t)((uint32_t)(&HRTIMx->sMasterRegs.MCR) + REG_OFFSET_TAB_TIMER[iTimer]));
  return (READ_BIT(*pReg, HRTIM_MCR_CK_PSC));
}

/**
  * @brief  Set the counter operating mode mode (single-shot, continuous or re-triggerable).
  * @rmtoll MCR        CONT         LL_HRTIM_TIM_SetCounterMode\n
  * @rmtoll MCR        RETRIG       LL_HRTIM_TIM_SetCounterMode\n
  * @rmtoll TIMxCR     CONT         LL_HRTIM_TIM_SetCounterMode\n
  * @rmtoll TIMxCR     RETRIG       LL_HRTIM_TIM_SetCounterMode
  * @param  HRTIMx High Resolution Timer instance
  * @param  Timer This parameter can be one of the following values:
  *         @arg @ref LL_HRTIM_TIMER_MASTER
  *         @arg @ref LL_HRTIM_TIMER_A
  *         @arg @ref LL_HRTIM_TIMER_B
  *         @arg @ref LL_HRTIM_TIMER_C
  *         @arg @ref LL_HRTIM_TIMER_D
  *         @arg @ref LL_HRTIM_TIMER_E
  * @param  Mode This parameter can be one of the following values:
  *         @arg @ref LL_HRTIM_MODE_CONTINUOUS
  *         @arg @ref LL_HRTIM_MODE_SINGLESHOT
  *         @arg @ref LL_HRTIM_MODE_RETRIGGERABLE
  * @retval None
  */
__STATIC_INLINE void LL_HRTIM_TIM_SetCounterMode(HRTIM_TypeDef *HRTIMx, uint32_t Timer, uint32_t Mode)
{
  register uint32_t iTimer = (uint8_t)(POSITION_VAL(Timer) - POSITION_VAL(HRTIM_MCR_MCEN));
  register uint32_t *pReg = (uint32_t *)((uint32_t)((uint32_t)(&HRTIMx->sMasterRegs.MCR) + REG_OFFSET_TAB_TIMER[iTimer]));
  MODIFY_REG(*pReg, (HRTIM_TIMCR_RETRIG | HRTIM_MCR_CONT), Mode);
}

/**
  * @brief  Get the counter operating mode mode
  * @rmtoll MCR        CONT         LL_HRTIM_TIM_GetCounterMode\n
  * @rmtoll MCR        RETRIG       LL_HRTIM_TIM_GetCounterMode\n
  * @rmtoll TIMxCR     CONT         LL_HRTIM_TIM_GetCounterMode\n
  * @rmtoll TIMxCR     RETRIG       LL_HRTIM_TIM_GetCounterMode
  * @param  HRTIMx High Resolution Timer instance
  * @param  Timer This parameter can be one of the following values:
  *         @arg @ref LL_HRTIM_TIMER_MASTER
  *         @arg @ref LL_HRTIM_TIMER_A
  *         @arg @ref LL_HRTIM_TIMER_B
  *         @arg @ref LL_HRTIM_TIMER_C
  *         @arg @ref LL_HRTIM_TIMER_D
  *         @arg @ref LL_HRTIM_TIMER_E
  * @retval Mode Returned value can be one of the following values:
  *         @arg @ref LL_HRTIM_MODE_CONTINUOUS
  *         @arg @ref LL_HRTIM_MODE_SINGLESHOT
  *         @arg @ref LL_HRTIM_MODE_RETRIGGERABLE
  */
__STATIC_INLINE uint32_t LL_HRTIM_TIM_GetCounterMode(HRTIM_TypeDef *HRTIMx, uint32_t Timer)
{
  register uint32_t iTimer = (uint8_t)(POSITION_VAL(Timer) - POSITION_VAL(HRTIM_MCR_MCEN));
  register uint32_t *pReg = (uint32_t *)((uint32_t)((uint32_t)(&HRTIMx->sMasterRegs.MCR) + REG_OFFSET_TAB_TIMER[iTimer]));
  return (READ_BIT(*pReg, (HRTIM_MCR_RETRIG | HRTIM_MCR_CONT)));
}

/**
  * @brief  Enable the half duty-cycle mode.
  * @rmtoll MCR        HALF         LL_HRTIM_TIM_EnableHalfMode\n
  * @rmtoll TIMxCR     HALF         LL_HRTIM_TIM_EnableHalfMode
  * @note When the half mode is enabled, HRTIM_MCMP1R (or HRTIM_CMP1xR)
  *       active register is automatically updated with HRTIM_MPER/2
  *       (or HRTIM_PERxR/2) value when HRTIM_MPER (or HRTIM_PERxR) register is written.
  * @param  HRTIMx High Resolution Timer instance
  * @param  Timer This parameter can be one of the following values:
  *         @arg @ref LL_HRTIM_TIMER_MASTER
  *         @arg @ref LL_HRTIM_TIMER_A
  *         @arg @ref LL_HRTIM_TIMER_B
  *         @arg @ref LL_HRTIM_TIMER_C
  *         @arg @ref LL_HRTIM_TIMER_D
  *         @arg @ref LL_HRTIM_TIMER_E
  * @retval None
  */
__STATIC_INLINE void LL_HRTIM_TIM_EnableHalfMode(HRTIM_TypeDef *HRTIMx, uint32_t Timer)
{
  register uint32_t iTimer = (uint8_t)(POSITION_VAL(Timer) - POSITION_VAL(HRTIM_MCR_MCEN));
  register uint32_t *pReg = (uint32_t *)((uint32_t)((uint32_t)(&HRTIMx->sMasterRegs.MCR) + REG_OFFSET_TAB_TIMER[iTimer]));
  SET_BIT(*pReg, HRTIM_MCR_HALF);
}

