zephyrproject-rtos/zephyr/ext/hal/st/stm32cube/stm32f3xx/drivers/include/stm32f3xx_ll_hrtim.h
/**
  * @brief  Set the reset trigger of a timer counter.
  * @rmtoll RSTxR      UPDT           LL_HRTIM_TIM_SetResetTrig\n
  * @rmtoll RSTxR      CMP2           LL_HRTIM_TIM_SetResetTrig\n
  * @rmtoll RSTxR      CMP4           LL_HRTIM_TIM_SetResetTrig\n
  * @rmtoll RSTxR      MSTPER         LL_HRTIM_TIM_SetResetTrig\n
  * @rmtoll RSTxR      MSTCMP1        LL_HRTIM_TIM_SetResetTrig\n
  * @rmtoll RSTxR      MSTCMP2        LL_HRTIM_TIM_SetResetTrig\n
  * @rmtoll RSTxR      MSTCMP3        LL_HRTIM_TIM_SetResetTrig\n
  * @rmtoll RSTxR      MSTCMP4        LL_HRTIM_TIM_SetResetTrig\n
  * @rmtoll RSTxR      EXTEVNT1       LL_HRTIM_TIM_SetResetTrig\n
  * @rmtoll RSTxR      EXTEVNT2       LL_HRTIM_TIM_SetResetTrig\n
  * @rmtoll RSTxR      EXTEVNT3       LL_HRTIM_TIM_SetResetTrig\n
  * @rmtoll RSTxR      EXTEVNT4       LL_HRTIM_TIM_SetResetTrig\n
  * @rmtoll RSTxR      EXTEVNT5       LL_HRTIM_TIM_SetResetTrig\n
  * @rmtoll RSTxR      EXTEVNT6       LL_HRTIM_TIM_SetResetTrig\n
  * @rmtoll RSTxR      EXTEVNT7       LL_HRTIM_TIM_SetResetTrig\n
  * @rmtoll RSTxR      EXTEVNT8       LL_HRTIM_TIM_SetResetTrig\n
  * @rmtoll RSTxR      EXTEVNT9       LL_HRTIM_TIM_SetResetTrig\n
  * @rmtoll RSTxR      EXTEVNT10      LL_HRTIM_TIM_SetResetTrig\n
  * @rmtoll RSTxR      TIMBCMP1       LL_HRTIM_TIM_SetResetTrig\n
  * @rmtoll RSTxR      TIMBCMP2       LL_HRTIM_TIM_SetResetTrig\n
  * @rmtoll RSTxR      TIMBCMP4       LL_HRTIM_TIM_SetResetTrig\n
  * @rmtoll RSTxR      TIMCCMP1       LL_HRTIM_TIM_SetResetTrig\n
  * @rmtoll RSTxR      TIMCCMP2       LL_HRTIM_TIM_SetResetTrig\n
  * @rmtoll RSTxR      TIMCCMP4       LL_HRTIM_TIM_SetResetTrig\n
  * @rmtoll RSTxR      TIMDCMP1       LL_HRTIM_TIM_SetResetTrig\n
  * @rmtoll RSTxR      TIMDCMP2       LL_HRTIM_TIM_SetResetTrig\n
  * @rmtoll RSTxR      TIMDCMP4       LL_HRTIM_TIM_SetResetTrig\n
  * @rmtoll RSTxR      TIMECMP1       LL_HRTIM_TIM_SetResetTrig\n
  * @rmtoll RSTxR      TIMECMP2       LL_HRTIM_TIM_SetResetTrig\n
  * @rmtoll RSTxR      TIMECMP4       LL_HRTIM_TIM_SetResetTrig
  * @note The reset of the timer counter can be triggered by up to 30 events
  *       that can be selected among the following sources:
  *         @arg The timing unit: Compare 2, Compare 4 and Update (3 events).
  *         @arg The master timer: Reset and Compare 1..4 (5 events).
  *         @arg The external events EXTEVNT1..10 (10 events).
  *         @arg All other timing units (e.g. Timer B..E for timer A): Compare 1, 2 and 4 (12 events).
  * @param  HRTIMx High Resolution Timer instance
  * @param  Timer This parameter can be one of the following values:
  *         @arg @ref LL_HRTIM_TIMER_A
  *         @arg @ref LL_HRTIM_TIMER_B
  *         @arg @ref LL_HRTIM_TIMER_C
  *         @arg @ref LL_HRTIM_TIMER_D
  *         @arg @ref LL_HRTIM_TIMER_E
  * @param  ResetTrig This parameter can be a combination of the following values:
  *         @arg @ref LL_HRTIM_RESETTRIG_NONE
  *         @arg @ref LL_HRTIM_RESETTRIG_UPDATE
  *         @arg @ref LL_HRTIM_RESETTRIG_CMP2
  *         @arg @ref LL_HRTIM_RESETTRIG_CMP4
  *         @arg @ref LL_HRTIM_RESETTRIG_MASTER_PER
  *         @arg @ref LL_HRTIM_RESETTRIG_MASTER_CMP1
  *         @arg @ref LL_HRTIM_RESETTRIG_MASTER_CMP2
  *         @arg @ref LL_HRTIM_RESETTRIG_MASTER_CMP3
  *         @arg @ref LL_HRTIM_RESETTRIG_MASTER_CMP4
  *         @arg @ref LL_HRTIM_RESETTRIG_EEV_1
  *         @arg @ref LL_HRTIM_RESETTRIG_EEV_2
  *         @arg @ref LL_HRTIM_RESETTRIG_EEV_3
  *         @arg @ref LL_HRTIM_RESETTRIG_EEV_4
  *         @arg @ref LL_HRTIM_RESETTRIG_EEV_5
  *         @arg @ref LL_HRTIM_RESETTRIG_EEV_6
  *         @arg @ref LL_HRTIM_RESETTRIG_EEV_7
  *         @arg @ref LL_HRTIM_RESETTRIG_EEV_8
  *         @arg @ref LL_HRTIM_RESETTRIG_EEV_9
  *         @arg @ref LL_HRTIM_RESETTRIG_EEV_10
  *         @arg @ref LL_HRTIM_RESETTRIG_OTHER1_CMP1
  *         @arg @ref LL_HRTIM_RESETTRIG_OTHER1_CMP2
  *         @arg @ref LL_HRTIM_RESETTRIG_OTHER1_CMP4
  *         @arg @ref LL_HRTIM_RESETTRIG_OTHER2_CMP1
  *         @arg @ref LL_HRTIM_RESETTRIG_OTHER2_CMP2
  *         @arg @ref LL_HRTIM_RESETTRIG_OTHER2_CMP4
  *         @arg @ref LL_HRTIM_RESETTRIG_OTHER3_CMP1
  *         @arg @ref LL_HRTIM_RESETTRIG_OTHER3_CMP2
  *         @arg @ref LL_HRTIM_RESETTRIG_OTHER3_CMP4
  *         @arg @ref LL_HRTIM_RESETTRIG_OTHER4_CMP1
  *         @arg @ref LL_HRTIM_RESETTRIG_OTHER4_CMP2
  *         @arg @ref LL_HRTIM_RESETTRIG_OTHER4_CMP4
  * @retval None
  */
__STATIC_INLINE void LL_HRTIM_TIM_SetResetTrig(HRTIM_TypeDef *HRTIMx, uint32_t Timer, uint32_t ResetTrig)
{
  register uint32_t iTimer = (uint8_t)(POSITION_VAL(Timer) - POSITION_VAL(HRTIM_MCR_TACEN));
  register uint32_t *pReg = (uint32_t *)((uint32_t)((uint32_t)(&HRTIMx->sTimerxRegs[0].RSTxR) +
                                                    REG_OFFSET_TAB_TIMER[iTimer]));
  WRITE_REG(*pReg, ResetTrig);
}

/**
  * @brief  Get actual reset trigger of a timer counter.
  * @rmtoll RSTxR      UPDT           LL_HRTIM_TIM_GetResetTrig\n
  * @rmtoll RSTxR      CMP2           LL_HRTIM_TIM_GetResetTrig\n
  * @rmtoll RSTxR      CMP4           LL_HRTIM_TIM_GetResetTrig\n
  * @rmtoll RSTxR      MSTPER         LL_HRTIM_TIM_GetResetTrig\n
  * @rmtoll RSTxR      MSTCMP1        LL_HRTIM_TIM_GetResetTrig\n
  * @rmtoll RSTxR      MSTCMP2        LL_HRTIM_TIM_GetResetTrig\n
  * @rmtoll RSTxR      MSTCMP3        LL_HRTIM_TIM_GetResetTrig\n
  * @rmtoll RSTxR      MSTCMP4        LL_HRTIM_TIM_GetResetTrig\n
  * @rmtoll RSTxR      EXTEVNT1       LL_HRTIM_TIM_GetResetTrig\n
  * @rmtoll RSTxR      EXTEVNT2       LL_HRTIM_TIM_GetResetTrig\n
  * @rmtoll RSTxR      EXTEVNT3       LL_HRTIM_TIM_GetResetTrig\n
  * @rmtoll RSTxR      EXTEVNT4       LL_HRTIM_TIM_GetResetTrig\n
  * @rmtoll RSTxR      EXTEVNT5       LL_HRTIM_TIM_GetResetTrig\n
  * @rmtoll RSTxR      EXTEVNT6       LL_HRTIM_TIM_GetResetTrig\n
  * @rmtoll RSTxR      EXTEVNT7       LL_HRTIM_TIM_GetResetTrig\n
  * @rmtoll RSTxR      EXTEVNT8       LL_HRTIM_TIM_GetResetTrig\n
  * @rmtoll RSTxR      EXTEVNT9       LL_HRTIM_TIM_GetResetTrig\n
  * @rmtoll RSTxR      EXTEVNT10      LL_HRTIM_TIM_GetResetTrig\n
  * @rmtoll RSTxR      TIMBCMP1       LL_HRTIM_TIM_GetResetTrig\n
  * @rmtoll RSTxR      TIMBCMP2       LL_HRTIM_TIM_GetResetTrig\n
  * @rmtoll RSTxR      TIMBCMP4       LL_HRTIM_TIM_GetResetTrig\n
  * @rmtoll RSTxR      TIMCCMP1       LL_HRTIM_TIM_GetResetTrig\n
  * @rmtoll RSTxR      TIMCCMP2       LL_HRTIM_TIM_GetResetTrig\n
  * @rmtoll RSTxR      TIMCCMP4       LL_HRTIM_TIM_GetResetTrig\n
  * @rmtoll RSTxR      TIMDCMP1       LL_HRTIM_TIM_GetResetTrig\n
  * @rmtoll RSTxR      TIMDCMP2       LL_HRTIM_TIM_GetResetTrig\n
  * @rmtoll RSTxR      TIMDCMP4       LL_HRTIM_TIM_GetResetTrig\n
  * @rmtoll RSTxR      TIMECMP1       LL_HRTIM_TIM_GetResetTrig\n
  * @rmtoll RSTxR      TIMECMP2       LL_HRTIM_TIM_GetResetTrig\n
  * @rmtoll RSTxR      TIMECMP4       LL_HRTIM_TIM_GetResetTrig
  * @param  HRTIMx High Resolution Timer instance
  * @param  Timer This parameter can be one of the following values:
  *         @arg @ref LL_HRTIM_TIMER_A
  *         @arg @ref LL_HRTIM_TIMER_B
  *         @arg @ref LL_HRTIM_TIMER_C
  *         @arg @ref LL_HRTIM_TIMER_D
  *         @arg @ref LL_HRTIM_TIMER_E
  * @retval ResetTrig Returned value can be one of the following values:
  *         @arg @ref LL_HRTIM_RESETTRIG_NONE
  *         @arg @ref LL_HRTIM_RESETTRIG_UPDATE
  *         @arg @ref LL_HRTIM_RESETTRIG_CMP2
  *         @arg @ref LL_HRTIM_RESETTRIG_CMP4
  *         @arg @ref LL_HRTIM_RESETTRIG_MASTER_PER
  *         @arg @ref LL_HRTIM_RESETTRIG_MASTER_CMP1
  *         @arg @ref LL_HRTIM_RESETTRIG_MASTER_CMP2
  *         @arg @ref LL_HRTIM_RESETTRIG_MASTER_CMP3
  *         @arg @ref LL_HRTIM_RESETTRIG_MASTER_CMP4
  *         @arg @ref LL_HRTIM_RESETTRIG_EEV_1
  *         @arg @ref LL_HRTIM_RESETTRIG_EEV_2
  *         @arg @ref LL_HRTIM_RESETTRIG_EEV_3
  *         @arg @ref LL_HRTIM_RESETTRIG_EEV_4
  *         @arg @ref LL_HRTIM_RESETTRIG_EEV_5
  *         @arg @ref LL_HRTIM_RESETTRIG_EEV_6
  *         @arg @ref LL_HRTIM_RESETTRIG_EEV_7
  *         @arg @ref LL_HRTIM_RESETTRIG_EEV_8
  *         @arg @ref LL_HRTIM_RESETTRIG_EEV_9
  *         @arg @ref LL_HRTIM_RESETTRIG_EEV_10
  *         @arg @ref LL_HRTIM_RESETTRIG_OTHER1_CMP1
  *         @arg @ref LL_HRTIM_RESETTRIG_OTHER1_CMP2
  *         @arg @ref LL_HRTIM_RESETTRIG_OTHER1_CMP4
  *         @arg @ref LL_HRTIM_RESETTRIG_OTHER2_CMP1
  *         @arg @ref LL_HRTIM_RESETTRIG_OTHER2_CMP2
  *         @arg @ref LL_HRTIM_RESETTRIG_OTHER2_CMP4
  *         @arg @ref LL_HRTIM_RESETTRIG_OTHER3_CMP1
  *         @arg @ref LL_HRTIM_RESETTRIG_OTHER3_CMP2
  *         @arg @ref LL_HRTIM_RESETTRIG_OTHER3_CMP4
  *         @arg @ref LL_HRTIM_RESETTRIG_OTHER4_CMP1
  *         @arg @ref LL_HRTIM_RESETTRIG_OTHER4_CMP2
  *         @arg @ref LL_HRTIM_RESETTRIG_OTHER4_CMP4
  */
__STATIC_INLINE uint32_t LL_HRTIM_TIM_GetResetTrig(HRTIM_TypeDef *HRTIMx, uint32_t Timer)
{
  register uint32_t iTimer = (uint8_t)(POSITION_VAL(Timer) - POSITION_VAL(HRTIM_MCR_TACEN));
  register uint32_t *pReg = (uint32_t *)((uint32_t)((uint32_t)(&HRTIMx->sTimerxRegs[0].RSTxR) +
                                                    REG_OFFSET_TAB_TIMER[iTimer]));
  return (READ_REG(*pReg));
}

/**
  * @brief  Get captured value for capture unit 1.
  * @rmtoll CPT1xR      CPT1x           LL_HRTIM_TIM_GetCapture1
  * @param  HRTIMx High Resolution Timer instance
  * @param  Timer This parameter can be one of the following values:
  *         @arg @ref LL_HRTIM_TIMER_A
  *         @arg @ref LL_HRTIM_TIMER_B
  *         @arg @ref LL_HRTIM_TIMER_C
  *         @arg @ref LL_HRTIM_TIMER_D
  *         @arg @ref LL_HRTIM_TIMER_E
  * @retval Captured value
  */
__STATIC_INLINE uint32_t LL_HRTIM_TIM_GetCapture1(HRTIM_TypeDef *HRTIMx, uint32_t Timer)
{
  register uint32_t iTimer = (uint8_t)(POSITION_VAL(Timer) - POSITION_VAL(HRTIM_MCR_TACEN));
  register uint32_t *pReg = (uint32_t *)((uint32_t)((uint32_t)(&HRTIMx->sTimerxRegs[0].CPT1xR) +
                                                    REG_OFFSET_TAB_TIMER[iTimer]));
  return (READ_REG(*pReg));
}

/**
  * @brief  Get captured value for capture unit 2.
  * @rmtoll CPT2xR      CPT2x           LL_HRTIM_TIM_GetCapture2
  * @param  HRTIMx High Resolution Timer instance
  * @param  Timer This parameter can be one of the following values:
  *         @arg @ref LL_HRTIM_TIMER_A
  *         @arg @ref LL_HRTIM_TIMER_B
  *         @arg @ref LL_HRTIM_TIMER_C
  *         @arg @ref LL_HRTIM_TIMER_D
  *         @arg @ref LL_HRTIM_TIMER_E
  * @retval Captured value
  */
__STATIC_INLINE uint32_t LL_HRTIM_TIM_GetCapture2(HRTIM_TypeDef *HRTIMx, uint32_t Timer)
{
  register uint32_t iTimer = (uint8_t)(POSITION_VAL(Timer) - POSITION_VAL(HRTIM_MCR_TACEN));
  register uint32_t *pReg = (uint32_t *)((uint32_t)((uint32_t)(&HRTIMx->sTimerxRegs[0].CPT2xR) +
                                                    REG_OFFSET_TAB_TIMER[iTimer]));
  return (READ_REG(*pReg));
}

/**
  * @brief  Set the trigger of a capture unit for a given timer.
  * @rmtoll CPT1xCR      SWCPT            LL_HRTIM_TIM_SetCaptureTrig\n
  * @rmtoll CPT1xCR      UPDCPT           LL_HRTIM_TIM_SetCaptureTrig\n
  * @rmtoll CPT1xCR      EXEV1CPT         LL_HRTIM_TIM_SetCaptureTrig\n
  * @rmtoll CPT1xCR      EXEV2CPT         LL_HRTIM_TIM_SetCaptureTrig\n
  * @rmtoll CPT1xCR      EXEV3CPT         LL_HRTIM_TIM_SetCaptureTrig\n
  * @rmtoll CPT1xCR      EXEV4CPT         LL_HRTIM_TIM_SetCaptureTrig\n
  * @rmtoll CPT1xCR      EXEV5CPT         LL_HRTIM_TIM_SetCaptureTrig\n
  * @rmtoll CPT1xCR      EXEV6CPT         LL_HRTIM_TIM_SetCaptureTrig\n
  * @rmtoll CPT1xCR      EXEV7CPT         LL_HRTIM_TIM_SetCaptureTrig\n
  * @rmtoll CPT1xCR      EXEV8CPT         LL_HRTIM_TIM_SetCaptureTrig\n
  * @rmtoll CPT1xCR      EXEV9CPT         LL_HRTIM_TIM_SetCaptureTrig\n
  * @rmtoll CPT1xCR      EXEV10CPT        LL_HRTIM_TIM_SetCaptureTrig\n
  * @rmtoll CPT1xCR      TA1SET           LL_HRTIM_TIM_SetCaptureTrig\n
  * @rmtoll CPT1xCR      TA1RST           LL_HRTIM_TIM_SetCaptureTrig\n
  * @rmtoll CPT1xCR      TACMP1           LL_HRTIM_TIM_SetCaptureTrig\n
  * @rmtoll CPT1xCR      TACMP2           LL_HRTIM_TIM_SetCaptureTrig\n
  * @rmtoll CPT1xCR      TB1SET           LL_HRTIM_TIM_SetCaptureTrig\n
  * @rmtoll CPT1xCR      TB1RST           LL_HRTIM_TIM_SetCaptureTrig\n
  * @rmtoll CPT1xCR      TBCMP1           LL_HRTIM_TIM_SetCaptureTrig\n
  * @rmtoll CPT1xCR      TBCMP2           LL_HRTIM_TIM_SetCaptureTrig\n
  * @rmtoll CPT1xCR      TC1SET           LL_HRTIM_TIM_SetCaptureTrig\n
  * @rmtoll CPT1xCR      TC1RST           LL_HRTIM_TIM_SetCaptureTrig\n
  * @rmtoll CPT1xCR      TCCMP1           LL_HRTIM_TIM_SetCaptureTrig\n
  * @rmtoll CPT1xCR      TCCMP2           LL_HRTIM_TIM_SetCaptureTrig\n
  * @rmtoll CPT1xCR      TD1SET           LL_HRTIM_TIM_SetCaptureTrig\n
  * @rmtoll CPT1xCR      TD1RST           LL_HRTIM_TIM_SetCaptureTrig\n
  * @rmtoll CPT1xCR      TDCMP1           LL_HRTIM_TIM_SetCaptureTrig\n
  * @rmtoll CPT1xCR      TDCMP2           LL_HRTIM_TIM_SetCaptureTrig\n
  * @rmtoll CPT1xCR      TE1SET           LL_HRTIM_TIM_SetCaptureTrig\n
  * @rmtoll CPT1xCR      TE1RST           LL_HRTIM_TIM_SetCaptureTrig\n
  * @rmtoll CPT1xCR      TECMP1           LL_HRTIM_TIM_SetCaptureTrig\n
  * @rmtoll CPT1xCR      TECMP2           LL_HRTIM_TIM_SetCaptureTrig
  * @param  HRTIMx High Resolution Timer instance
  * @param  Timer This parameter can be one of the following values:
  *         @arg @ref LL_HRTIM_TIMER_A
  *         @arg @ref LL_HRTIM_TIMER_B
  *         @arg @ref LL_HRTIM_TIMER_C
  *         @arg @ref LL_HRTIM_TIMER_D
  *         @arg @ref LL_HRTIM_TIMER_E
  * @param  CaptureUnit This parameter can be one of the following values:
  *         @arg @ref LL_HRTIM_CAPTUREUNIT_1
  *         @arg @ref LL_HRTIM_CAPTUREUNIT_2
  * @param  CaptureTrig This parameter can be a combination of the following values:
  *         @arg @ref LL_HRTIM_CAPTURETRIG_NONE
  *         @arg @ref LL_HRTIM_CAPTURETRIG_UPDATE
  *         @arg @ref LL_HRTIM_CAPTURETRIG_EEV_1
  *         @arg @ref LL_HRTIM_CAPTURETRIG_EEV_2
  *         @arg @ref LL_HRTIM_CAPTURETRIG_EEV_3
  *         @arg @ref LL_HRTIM_CAPTURETRIG_EEV_4
  *         @arg @ref LL_HRTIM_CAPTURETRIG_EEV_5
  *         @arg @ref LL_HRTIM_CAPTURETRIG_EEV_6
  *         @arg @ref LL_HRTIM_CAPTURETRIG_EEV_7
  *         @arg @ref LL_HRTIM_CAPTURETRIG_EEV_8
  *         @arg @ref LL_HRTIM_CAPTURETRIG_EEV_9
  *         @arg @ref LL_HRTIM_CAPTURETRIG_EEV_10
  *         @arg @ref LL_HRTIM_CAPTURETRIG_TA1_SET
  *         @arg @ref LL_HRTIM_CAPTURETRIG_TA1_RESET
  *         @arg @ref LL_HRTIM_CAPTURETRIG_TIMA_CMP1
  *         @arg @ref LL_HRTIM_CAPTURETRIG_TIMA_CMP2
  *         @arg @ref LL_HRTIM_CAPTURETRIG_TB1_SET
  *         @arg @ref LL_HRTIM_CAPTURETRIG_TB1_RESET
  *         @arg @ref LL_HRTIM_CAPTURETRIG_TIMB_CMP1
  *         @arg @ref LL_HRTIM_CAPTURETRIG_TIMB_CMP2
  *         @arg @ref LL_HRTIM_CAPTURETRIG_TC1_SET
  *         @arg @ref LL_HRTIM_CAPTURETRIG_TC1_RESET
  *         @arg @ref LL_HRTIM_CAPTURETRIG_TIMC_CMP1
  *         @arg @ref LL_HRTIM_CAPTURETRIG_TIMC_CMP2
  *         @arg @ref LL_HRTIM_CAPTURETRIG_TD1_SET
  *         @arg @ref LL_HRTIM_CAPTURETRIG_TD1_RESET
  *         @arg @ref LL_HRTIM_CAPTURETRIG_TIMD_CMP1
  *         @arg @ref LL_HRTIM_CAPTURETRIG_TIMD_CMP2
  *         @arg @ref LL_HRTIM_CAPTURETRIG_TE1_SET
  *         @arg @ref LL_HRTIM_CAPTURETRIG_TE1_RESET
  *         @arg @ref LL_HRTIM_CAPTURETRIG_TIME_CMP1
  *         @arg @ref LL_HRTIM_CAPTURETRIG_TIME_CMP2
  * @retval None
  */
__STATIC_INLINE void LL_HRTIM_TIM_SetCaptureTrig(HRTIM_TypeDef *HRTIMx, uint32_t Timer, uint32_t CaptureUnit,
                                                 uint32_t CaptureTrig)
{
  register uint32_t iTimer = (uint8_t)(POSITION_VAL(Timer) - POSITION_VAL(HRTIM_MCR_TACEN));
  register uint32_t *pReg = (uint32_t *)((uint32_t)((uint32_t)(&HRTIMx->sTimerxRegs[0].CPT1xCR) +
                                                    REG_OFFSET_TAB_TIMER[iTimer] + CaptureUnit * 4));
  WRITE_REG(*pReg, CaptureTrig);
}

/**
  * @brief  Get actual trigger of a capture unit for a given timer.
  * @rmtoll CPT1xCR      SWCPT            LL_HRTIM_TIM_GetCaptureTrig\n
  * @rmtoll CPT1xCR      UPDCPT           LL_HRTIM_TIM_GetCaptureTrig\n
  * @rmtoll CPT1xCR      EXEV1CPT         LL_HRTIM_TIM_GetCaptureTrig\n
  * @rmtoll CPT1xCR      EXEV2CPT         LL_HRTIM_TIM_GetCaptureTrig\n
  * @rmtoll CPT1xCR      EXEV3CPT         LL_HRTIM_TIM_GetCaptureTrig\n
  * @rmtoll CPT1xCR      EXEV4CPT         LL_HRTIM_TIM_GetCaptureTrig\n
  * @rmtoll CPT1xCR      EXEV5CPT         LL_HRTIM_TIM_GetCaptureTrig\n
  * @rmtoll CPT1xCR      EXEV6CPT         LL_HRTIM_TIM_GetCaptureTrig\n
  * @rmtoll CPT1xCR      EXEV7CPT         LL_HRTIM_TIM_GetCaptureTrig\n
  * @rmtoll CPT1xCR      EXEV8CPT         LL_HRTIM_TIM_GetCaptureTrig\n
  * @rmtoll CPT1xCR      EXEV9CPT         LL_HRTIM_TIM_GetCaptureTrig\n
  * @rmtoll CPT1xCR      EXEV10CPT        LL_HRTIM_TIM_GetCaptureTrig\n
  * @rmtoll CPT1xCR      TA1SET           LL_HRTIM_TIM_GetCaptureTrig\n
  * @rmtoll CPT1xCR      TA1RST           LL_HRTIM_TIM_GetCaptureTrig\n
  * @rmtoll CPT1xCR      TACMP1           LL_HRTIM_TIM_GetCaptureTrig\n
  * @rmtoll CPT1xCR      TACMP2           LL_HRTIM_TIM_GetCaptureTrig\n
  * @rmtoll CPT1xCR      TB1SET           LL_HRTIM_TIM_GetCaptureTrig\n
  * @rmtoll CPT1xCR      TB1RST           LL_HRTIM_TIM_GetCaptureTrig\n
  * @rmtoll CPT1xCR      TBCMP1           LL_HRTIM_TIM_GetCaptureTrig\n
  * @rmtoll CPT1xCR      TBCMP2           LL_HRTIM_TIM_GetCaptureTrig\n
  * @rmtoll CPT1xCR      TC1SET           LL_HRTIM_TIM_GetCaptureTrig\n
  * @rmtoll CPT1xCR      TC1RST           LL_HRTIM_TIM_GetCaptureTrig\n
  * @rmtoll CPT1xCR      TCCMP1           LL_HRTIM_TIM_GetCaptureTrig\n
  * @rmtoll CPT1xCR      TCCMP2           LL_HRTIM_TIM_GetCaptureTrig\n
  * @rmtoll CPT1xCR      TD1SET           LL_HRTIM_TIM_GetCaptureTrig\n
  * @rmtoll CPT1xCR      TD1RST           LL_HRTIM_TIM_GetCaptureTrig\n
  * @rmtoll CPT1xCR      TDCMP1           LL_HRTIM_TIM_GetCaptureTrig\n
  * @rmtoll CPT1xCR      TDCMP2           LL_HRTIM_TIM_GetCaptureTrig\n
  * @rmtoll CPT1xCR      TE1SET           LL_HRTIM_TIM_GetCaptureTrig\n
  * @rmtoll CPT1xCR      TE1RST           LL_HRTIM_TIM_GetCaptureTrig\n
  * @rmtoll CPT1xCR      TECMP1           LL_HRTIM_TIM_GetCaptureTrig\n
  * @rmtoll CPT1xCR      TECMP2           LL_HRTIM_TIM_GetCaptureTrig
  * @param  HRTIMx High Resolution Timer instance
  * @param  Timer This parameter can be one of the following values:
  *         @arg @ref LL_HRTIM_TIMER_A
  *         @arg @ref LL_HRTIM_TIMER_B
  *         @arg @ref LL_HRTIM_TIMER_C
  *         @arg @ref LL_HRTIM_TIMER_D
  *         @arg @ref LL_HRTIM_TIMER_E
  * @param  CaptureUnit This parameter can be one of the following values:
  *         @arg @ref LL_HRTIM_CAPTUREUNIT_1
  *         @arg @ref LL_HRTIM_CAPTUREUNIT_2
  * @retval CaptureTrig This parameter can be a combination of the following values:
  *         @arg @ref LL_HRTIM_CAPTURETRIG_NONE
  *         @arg @ref LL_HRTIM_CAPTURETRIG_UPDATE
  *         @arg @ref LL_HRTIM_CAPTURETRIG_EEV_1
  *         @arg @ref LL_HRTIM_CAPTURETRIG_EEV_2
  *         @arg @ref LL_HRTIM_CAPTURETRIG_EEV_3
  *         @arg @ref LL_HRTIM_CAPTURETRIG_EEV_4
  *         @arg @ref LL_HRTIM_CAPTURETRIG_EEV_5
  *         @arg @ref LL_HRTIM_CAPTURETRIG_EEV_6
  *         @arg @ref LL_HRTIM_CAPTURETRIG_EEV_7
  *         @arg @ref LL_HRTIM_CAPTURETRIG_EEV_8
  *         @arg @ref LL_HRTIM_CAPTURETRIG_EEV_9
  *         @arg @ref LL_HRTIM_CAPTURETRIG_EEV_10
  *         @arg @ref LL_HRTIM_CAPTURETRIG_TA1_SET
  *         @arg @ref LL_HRTIM_CAPTURETRIG_TA1_RESET
  *         @arg @ref LL_HRTIM_CAPTURETRIG_TIMA_CMP1
  *         @arg @ref LL_HRTIM_CAPTURETRIG_TIMA_CMP2
  *         @arg @ref LL_HRTIM_CAPTURETRIG_TB1_SET
  *         @arg @ref LL_HRTIM_CAPTURETRIG_TB1_RESET
  *         @arg @ref LL_HRTIM_CAPTURETRIG_TIMB_CMP1
  *         @arg @ref LL_HRTIM_CAPTURETRIG_TIMB_CMP2
  *         @arg @ref LL_HRTIM_CAPTURETRIG_TC1_SET
  *         @arg @ref LL_HRTIM_CAPTURETRIG_TC1_RESET
  *         @arg @ref LL_HRTIM_CAPTURETRIG_TIMC_CMP1
  *         @arg @ref LL_HRTIM_CAPTURETRIG_TIMC_CMP2
  *         @arg @ref LL_HRTIM_CAPTURETRIG_TD1_SET
  *         @arg @ref LL_HRTIM_CAPTURETRIG_TD1_RESET
  *         @arg @ref LL_HRTIM_CAPTURETRIG_TIMD_CMP1
  *         @arg @ref LL_HRTIM_CAPTURETRIG_TIMD_CMP2
  *         @arg @ref LL_HRTIM_CAPTURETRIG_TE1_SET
  *         @arg @ref LL_HRTIM_CAPTURETRIG_TE1_RESET
  *         @arg @ref LL_HRTIM_CAPTURETRIG_TIME_CMP1
  *         @arg @ref LL_HRTIM_CAPTURETRIG_TIME_CMP2
  */
__STATIC_INLINE uint32_t LL_HRTIM_TIM_GetCaptureTrig(HRTIM_TypeDef *HRTIMx, uint32_t Timer, uint32_t CaptureUnit)
{
  register uint32_t iTimer = (uint8_t)(POSITION_VAL(Timer) - POSITION_VAL(HRTIM_MCR_TACEN));
  register uint32_t *pReg = (uint32_t *)((uint32_t)((uint32_t)(&HRTIMx->sTimerxRegs[0].CPT1xCR) +
                                                    REG_OFFSET_TAB_TIMER[iTimer] + CaptureUnit * 4));
  return (READ_REG(*pReg));
}

/**
  * @brief  Enable deadtime insertion for a given timer.
  * @rmtoll OUTxR      DTEN           LL_HRTIM_TIM_EnableDeadTime
  * @param  HRTIMx High Resolution Timer instance
  * @param  Timer This parameter can be one of the following values:
  *         @arg @ref LL_HRTIM_TIMER_A
  *         @arg @ref LL_HRTIM_TIMER_B
  *         @arg @ref LL_HRTIM_TIMER_C
  *         @arg @ref LL_HRTIM_TIMER_D
  *         @arg @ref LL_HRTIM_TIMER_E
  * @retval None
  */
__STATIC_INLINE void LL_HRTIM_TIM_EnableDeadTime(HRTIM_TypeDef *HRTIMx, uint32_t Timer)
{
  register uint32_t iTimer = (uint8_t)(POSITION_VAL(Timer) - POSITION_VAL(HRTIM_MCR_TACEN));
  register uint32_t *pReg = (uint32_t *)((uint32_t)((uint32_t)(&HRTIMx->sTimerxRegs[0].OUTxR) +
                                                    REG_OFFSET_TAB_TIMER[iTimer]));
  SET_BIT(*pReg, HRTIM_OUTR_DTEN);
}

/**
  * @brief  Disable deadtime insertion for a given timer.
  * @rmtoll OUTxR      DTEN           LL_HRTIM_TIM_DisableDeadTime
  * @param  HRTIMx High Resolution Timer instance
  * @param  Timer This parameter can be one of the following values:
  *         @arg @ref LL_HRTIM_TIMER_A
  *         @arg @ref LL_HRTIM_TIMER_B
  *         @arg @ref LL_HRTIM_TIMER_C
  *         @arg @ref LL_HRTIM_TIMER_D
  *         @arg @ref LL_HRTIM_TIMER_E
  * @retval None
  */
__STATIC_INLINE void LL_HRTIM_TIM_DisableDeadTime(HRTIM_TypeDef *HRTIMx, uint32_t Timer)
{
  register uint32_t iTimer = (uint8_t)(POSITION_VAL(Timer) - POSITION_VAL(HRTIM_MCR_TACEN));
  register uint32_t *pReg = (uint32_t *)((uint32_t)((uint32_t)(&HRTIMx->sTimerxRegs[0].OUTxR) +
                                                    REG_OFFSET_TAB_TIMER[iTimer]));
  CLEAR_BIT(*pReg, HRTIM_OUTR_DTEN);
}

/**
  * @brief  Indicate whether deadtime insertion is enabled for a given timer.
  * @rmtoll OUTxR      DTEN           LL_HRTIM_TIM_IsEnabledDeadTime
  * @param  HRTIMx High Resolution Timer instance
  * @param  Timer This parameter can be one of the following values:
  *         @arg @ref LL_HRTIM_TIMER_A
  *         @arg @ref LL_HRTIM_TIMER_B
  *         @arg @ref LL_HRTIM_TIMER_C
  *         @arg @ref LL_HRTIM_TIMER_D
  *         @arg @ref LL_HRTIM_TIMER_E
  * @retval State of DTEN bit in HRTIM_OUTxR register (1 or 0).
  */
__STATIC_INLINE uint32_t LL_HRTIM_TIM_IsEnabledDeadTime(HRTIM_TypeDef *HRTIMx, uint32_t Timer)
{
  register uint32_t iTimer = (uint8_t)(POSITION_VAL(Timer) - POSITION_VAL(HRTIM_MCR_TACEN));
  register uint32_t *pReg = (uint32_t *)((uint32_t)((uint32_t)(&HRTIMx->sTimerxRegs[0].OUTxR) +
                                                    REG_OFFSET_TAB_TIMER[iTimer]));
  return (READ_BIT(*pReg, HRTIM_OUTR_DTEN) == HRTIM_OUTR_DTEN);
}

