zephyrproject-rtos/zephyr/ext/hal/st/stm32cube/stm32f3xx/drivers/include/stm32f3xx_ll_hrtim.h
/**
  * @brief  Get the timer output set source.
  * @rmtoll SETx1R      SST          LL_HRTIM_OUT_GetOutputSetSrc\n
  * @rmtoll SETx1R      RESYNC       LL_HRTIM_OUT_GetOutputSetSrc\n
  * @rmtoll SETx1R      PER          LL_HRTIM_OUT_GetOutputSetSrc\n
  * @rmtoll SETx1R      CMP1         LL_HRTIM_OUT_GetOutputSetSrc\n
  * @rmtoll SETx1R      CMP2         LL_HRTIM_OUT_GetOutputSetSrc\n
  * @rmtoll SETx1R      CMP3         LL_HRTIM_OUT_GetOutputSetSrc\n
  * @rmtoll SETx1R      CMP4         LL_HRTIM_OUT_GetOutputSetSrc\n
  * @rmtoll SETx1R      MSTPER       LL_HRTIM_OUT_GetOutputSetSrc\n
  * @rmtoll SETx1R      MSTCMP1      LL_HRTIM_OUT_GetOutputSetSrc\n
  * @rmtoll SETx1R      MSTCMP2      LL_HRTIM_OUT_GetOutputSetSrc\n
  * @rmtoll SETx1R      MSTCMP3      LL_HRTIM_OUT_GetOutputSetSrc\n
  * @rmtoll SETx1R      MSTCMP4      LL_HRTIM_OUT_GetOutputSetSrc\n
  * @rmtoll SETx1R      TIMEVNT1     LL_HRTIM_OUT_GetOutputSetSrc\n
  * @rmtoll SETx1R      TIMEVNT2     LL_HRTIM_OUT_GetOutputSetSrc\n
  * @rmtoll SETx1R      TIMEVNT3     LL_HRTIM_OUT_GetOutputSetSrc\n
  * @rmtoll SETx1R      TIMEVNT4     LL_HRTIM_OUT_GetOutputSetSrc\n
  * @rmtoll SETx1R      TIMEVNT5     LL_HRTIM_OUT_GetOutputSetSrc\n
  * @rmtoll SETx1R      TIMEVNT6     LL_HRTIM_OUT_GetOutputSetSrc\n
  * @rmtoll SETx1R      TIMEVNT7     LL_HRTIM_OUT_GetOutputSetSrc\n
  * @rmtoll SETx1R      TIMEVNT8     LL_HRTIM_OUT_GetOutputSetSrc\n
  * @rmtoll SETx1R      TIMEVNT9     LL_HRTIM_OUT_GetOutputSetSrc\n
  * @rmtoll SETx1R      EXEVNT1      LL_HRTIM_OUT_GetOutputSetSrc\n
  * @rmtoll SETx1R      EXEVNT2      LL_HRTIM_OUT_GetOutputSetSrc\n
  * @rmtoll SETx1R      EXEVNT3      LL_HRTIM_OUT_GetOutputSetSrc\n
  * @rmtoll SETx1R      EXEVNT4      LL_HRTIM_OUT_GetOutputSetSrc\n
  * @rmtoll SETx1R      EXEVNT5      LL_HRTIM_OUT_GetOutputSetSrc\n
  * @rmtoll SETx1R      EXEVNT6      LL_HRTIM_OUT_GetOutputSetSrc\n
  * @rmtoll SETx1R      EXEVNT7      LL_HRTIM_OUT_GetOutputSetSrc\n
  * @rmtoll SETx1R      EXEVNT8      LL_HRTIM_OUT_GetOutputSetSrc\n
  * @rmtoll SETx1R      EXEVNT9      LL_HRTIM_OUT_GetOutputSetSrc\n
  * @rmtoll SETx1R      EXEVNT10     LL_HRTIM_OUT_GetOutputSetSrc\n
  * @rmtoll SETx1R      UPDATE       LL_HRTIM_OUT_GetOutputSetSrc\n
  * @rmtoll SETx1R      SST          LL_HRTIM_OUT_GetOutputSetSrc\n
  * @rmtoll SETx1R      RESYNC       LL_HRTIM_OUT_GetOutputSetSrc\n
  * @rmtoll SETx1R      PER          LL_HRTIM_OUT_GetOutputSetSrc\n
  * @rmtoll SETx1R      CMP1         LL_HRTIM_OUT_GetOutputSetSrc\n
  * @rmtoll SETx1R      CMP2         LL_HRTIM_OUT_GetOutputSetSrc\n
  * @rmtoll SETx1R      CMP3         LL_HRTIM_OUT_GetOutputSetSrc\n
  * @rmtoll SETx1R      CMP4         LL_HRTIM_OUT_GetOutputSetSrc\n
  * @rmtoll SETx1R      MSTPER       LL_HRTIM_OUT_GetOutputSetSrc\n
  * @rmtoll SETx1R      MSTCMP1      LL_HRTIM_OUT_GetOutputSetSrc\n
  * @rmtoll SETx1R      MSTCMP2      LL_HRTIM_OUT_GetOutputSetSrc\n
  * @rmtoll SETx1R      MSTCMP3      LL_HRTIM_OUT_GetOutputSetSrc\n
  * @rmtoll SETx1R      MSTCMP4      LL_HRTIM_OUT_GetOutputSetSrc\n
  * @rmtoll SETx1R      TIMEVNT1     LL_HRTIM_OUT_GetOutputSetSrc\n
  * @rmtoll SETx1R      TIMEVNT2     LL_HRTIM_OUT_GetOutputSetSrc\n
  * @rmtoll SETx1R      TIMEVNT3     LL_HRTIM_OUT_GetOutputSetSrc\n
  * @rmtoll SETx1R      TIMEVNT4     LL_HRTIM_OUT_GetOutputSetSrc\n
  * @rmtoll SETx1R      TIMEVNT5     LL_HRTIM_OUT_GetOutputSetSrc\n
  * @rmtoll SETx1R      TIMEVNT6     LL_HRTIM_OUT_GetOutputSetSrc\n
  * @rmtoll SETx1R      TIMEVNT7     LL_HRTIM_OUT_GetOutputSetSrc\n
  * @rmtoll SETx1R      TIMEVNT8     LL_HRTIM_OUT_GetOutputSetSrc\n
  * @rmtoll SETx1R      TIMEVNT9     LL_HRTIM_OUT_GetOutputSetSrc\n
  * @rmtoll SETx1R      EXEVNT1      LL_HRTIM_OUT_GetOutputSetSrc\n
  * @rmtoll SETx1R      EXEVNT2      LL_HRTIM_OUT_GetOutputSetSrc\n
  * @rmtoll SETx1R      EXEVNT3      LL_HRTIM_OUT_GetOutputSetSrc\n
  * @rmtoll SETx1R      EXEVNT4      LL_HRTIM_OUT_GetOutputSetSrc\n
  * @rmtoll SETx1R      EXEVNT5      LL_HRTIM_OUT_GetOutputSetSrc\n
  * @rmtoll SETx1R      EXEVNT6      LL_HRTIM_OUT_GetOutputSetSrc\n
  * @rmtoll SETx1R      EXEVNT7      LL_HRTIM_OUT_GetOutputSetSrc\n
  * @rmtoll SETx1R      EXEVNT8      LL_HRTIM_OUT_GetOutputSetSrc\n
  * @rmtoll SETx1R      EXEVNT9      LL_HRTIM_OUT_GetOutputSetSrc\n
  * @rmtoll SETx1R      EXEVNT10     LL_HRTIM_OUT_GetOutputSetSrc\n
  * @rmtoll SETx1R      UPDATE       LL_HRTIM_OUT_GetOutputSetSrc
  * @param  HRTIMx High Resolution Timer instance
  * @param  Output This parameter can be one of the following values:
  *         @arg @ref LL_HRTIM_OUTPUT_TA1
  *         @arg @ref LL_HRTIM_OUTPUT_TA2
  *         @arg @ref LL_HRTIM_OUTPUT_TB1
  *         @arg @ref LL_HRTIM_OUTPUT_TB2
  *         @arg @ref LL_HRTIM_OUTPUT_TC1
  *         @arg @ref LL_HRTIM_OUTPUT_TC2
  *         @arg @ref LL_HRTIM_OUTPUT_TD1
  *         @arg @ref LL_HRTIM_OUTPUT_TD2
  *         @arg @ref LL_HRTIM_OUTPUT_TE1
  *         @arg @ref LL_HRTIM_OUTPUT_TE2
  * @retval SetSrc This parameter can be a combination of the following values:
  *         @arg @ref LL_HRTIM_CROSSBAR_NONE
  *         @arg @ref LL_HRTIM_CROSSBAR_RESYNC
  *         @arg @ref LL_HRTIM_CROSSBAR_TIMPER
  *         @arg @ref LL_HRTIM_CROSSBAR_TIMCMP1
  *         @arg @ref LL_HRTIM_CROSSBAR_TIMCMP2
  *         @arg @ref LL_HRTIM_CROSSBAR_TIMCMP3
  *         @arg @ref LL_HRTIM_CROSSBAR_TIMCMP4
  *         @arg @ref LL_HRTIM_CROSSBAR_MASTERPER
  *         @arg @ref LL_HRTIM_CROSSBAR_MASTERCMP1
  *         @arg @ref LL_HRTIM_CROSSBAR_MASTERCMP2
  *         @arg @ref LL_HRTIM_CROSSBAR_MASTERCMP3
  *         @arg @ref LL_HRTIM_CROSSBAR_MASTERCMP4
  *         @arg @ref LL_HRTIM_CROSSBAR_TIMEV_1
  *         @arg @ref LL_HRTIM_CROSSBAR_TIMEV_2
  *         @arg @ref LL_HRTIM_CROSSBAR_TIMEV_3
  *         @arg @ref LL_HRTIM_CROSSBAR_TIMEV_4
  *         @arg @ref LL_HRTIM_CROSSBAR_TIMEV_5
  *         @arg @ref LL_HRTIM_CROSSBAR_TIMEV_6
  *         @arg @ref LL_HRTIM_CROSSBAR_TIMEV_7
  *         @arg @ref LL_HRTIM_CROSSBAR_TIMEV_8
  *         @arg @ref LL_HRTIM_CROSSBAR_TIMEV_9
  *         @arg @ref LL_HRTIM_CROSSBAR_EEV_1
  *         @arg @ref LL_HRTIM_CROSSBAR_EEV_2
  *         @arg @ref LL_HRTIM_CROSSBAR_EEV_3
  *         @arg @ref LL_HRTIM_CROSSBAR_EEV_4
  *         @arg @ref LL_HRTIM_CROSSBAR_EEV_5
  *         @arg @ref LL_HRTIM_CROSSBAR_EEV_6
  *         @arg @ref LL_HRTIM_CROSSBAR_EEV_7
  *         @arg @ref LL_HRTIM_CROSSBAR_EEV_8
  *         @arg @ref LL_HRTIM_CROSSBAR_EEV_9
  *         @arg @ref LL_HRTIM_CROSSBAR_EEV_10
  *         @arg @ref LL_HRTIM_CROSSBAR_UPDATE
  */
__STATIC_INLINE uint32_t LL_HRTIM_OUT_GetOutputSetSrc(HRTIM_TypeDef *HRTIMx, uint32_t Output)
{
  register uint32_t iOutput = (uint8_t)(POSITION_VAL(Output) - POSITION_VAL(LL_HRTIM_OUTPUT_TA1));
  register uint32_t *pReg = (uint32_t *)((uint32_t)((uint32_t)(&HRTIMx->sTimerxRegs[0].SETx1R) +
                                                    REG_OFFSET_TAB_SETxR[iOutput]));
  return (uint32_t) READ_REG(*pReg);
}

/**
  * @brief  Set the timer output reset source.
  * @rmtoll RSTx1R      RST          LL_HRTIM_OUT_SetOutputResetSrc\n
  * @rmtoll RSTx1R      RESYNC       LL_HRTIM_OUT_SetOutputResetSrc\n
  * @rmtoll RSTx1R      PER          LL_HRTIM_OUT_SetOutputResetSrc\n
  * @rmtoll RSTx1R      CMP1         LL_HRTIM_OUT_SetOutputResetSrc\n
  * @rmtoll RSTx1R      CMP2         LL_HRTIM_OUT_SetOutputResetSrc\n
  * @rmtoll RSTx1R      CMP3         LL_HRTIM_OUT_SetOutputResetSrc\n
  * @rmtoll RSTx1R      CMP4         LL_HRTIM_OUT_SetOutputResetSrc\n
  * @rmtoll RSTx1R      MSTPER       LL_HRTIM_OUT_SetOutputResetSrc\n
  * @rmtoll RSTx1R      MSTCMP1      LL_HRTIM_OUT_SetOutputResetSrc\n
  * @rmtoll RSTx1R      MSTCMP2      LL_HRTIM_OUT_SetOutputResetSrc\n
  * @rmtoll RSTx1R      MSTCMP3      LL_HRTIM_OUT_SetOutputResetSrc\n
  * @rmtoll RSTx1R      MSTCMP4      LL_HRTIM_OUT_SetOutputResetSrc\n
  * @rmtoll RSTx1R      TIMEVNT1     LL_HRTIM_OUT_SetOutputResetSrc\n
  * @rmtoll RSTx1R      TIMEVNT2     LL_HRTIM_OUT_SetOutputResetSrc\n
  * @rmtoll RSTx1R      TIMEVNT3     LL_HRTIM_OUT_SetOutputResetSrc\n
  * @rmtoll RSTx1R      TIMEVNT4     LL_HRTIM_OUT_SetOutputResetSrc\n
  * @rmtoll RSTx1R      TIMEVNT5     LL_HRTIM_OUT_SetOutputResetSrc\n
  * @rmtoll RSTx1R      TIMEVNT6     LL_HRTIM_OUT_SetOutputResetSrc\n
  * @rmtoll RSTx1R      TIMEVNT7     LL_HRTIM_OUT_SetOutputResetSrc\n
  * @rmtoll RSTx1R      TIMEVNT8     LL_HRTIM_OUT_SetOutputResetSrc\n
  * @rmtoll RSTx1R      TIMEVNT9     LL_HRTIM_OUT_SetOutputResetSrc\n
  * @rmtoll RSTx1R      EXEVNT1      LL_HRTIM_OUT_SetOutputResetSrc\n
  * @rmtoll RSTx1R      EXEVNT2      LL_HRTIM_OUT_SetOutputResetSrc\n
  * @rmtoll RSTx1R      EXEVNT3      LL_HRTIM_OUT_SetOutputResetSrc\n
  * @rmtoll RSTx1R      EXEVNT4      LL_HRTIM_OUT_SetOutputResetSrc\n
  * @rmtoll RSTx1R      EXEVNT5      LL_HRTIM_OUT_SetOutputResetSrc\n
  * @rmtoll RSTx1R      EXEVNT6      LL_HRTIM_OUT_SetOutputResetSrc\n
  * @rmtoll RSTx1R      EXEVNT7      LL_HRTIM_OUT_SetOutputResetSrc\n
  * @rmtoll RSTx1R      EXEVNT8      LL_HRTIM_OUT_SetOutputResetSrc\n
  * @rmtoll RSTx1R      EXEVNT9      LL_HRTIM_OUT_SetOutputResetSrc\n
  * @rmtoll RSTx1R      EXEVNT10     LL_HRTIM_OUT_SetOutputResetSrc\n
  * @rmtoll RSTx1R      UPDATE       LL_HRTIM_OUT_SetOutputResetSrc\n
  * @rmtoll RSTx1R      RST          LL_HRTIM_OUT_SetOutputResetSrc\n
  * @rmtoll RSTx1R      RESYNC       LL_HRTIM_OUT_SetOutputResetSrc\n
  * @rmtoll RSTx1R      PER          LL_HRTIM_OUT_SetOutputResetSrc\n
  * @rmtoll RSTx1R      CMP1         LL_HRTIM_OUT_SetOutputResetSrc\n
  * @rmtoll RSTx1R      CMP2         LL_HRTIM_OUT_SetOutputResetSrc\n
  * @rmtoll RSTx1R      CMP3         LL_HRTIM_OUT_SetOutputResetSrc\n
  * @rmtoll RSTx1R      CMP4         LL_HRTIM_OUT_SetOutputResetSrc\n
  * @rmtoll RSTx1R      MSTPER       LL_HRTIM_OUT_SetOutputResetSrc\n
  * @rmtoll RSTx1R      MSTCMP1      LL_HRTIM_OUT_SetOutputResetSrc\n
  * @rmtoll RSTx1R      MSTCMP2      LL_HRTIM_OUT_SetOutputResetSrc\n
  * @rmtoll RSTx1R      MSTCMP3      LL_HRTIM_OUT_SetOutputResetSrc\n
  * @rmtoll RSTx1R      MSTCMP4      LL_HRTIM_OUT_SetOutputResetSrc\n
  * @rmtoll RSTx1R      TIMEVNT1     LL_HRTIM_OUT_SetOutputResetSrc\n
  * @rmtoll RSTx1R      TIMEVNT2     LL_HRTIM_OUT_SetOutputResetSrc\n
  * @rmtoll RSTx1R      TIMEVNT3     LL_HRTIM_OUT_SetOutputResetSrc\n
  * @rmtoll RSTx1R      TIMEVNT4     LL_HRTIM_OUT_SetOutputResetSrc\n
  * @rmtoll RSTx1R      TIMEVNT5     LL_HRTIM_OUT_SetOutputResetSrc\n
  * @rmtoll RSTx1R      TIMEVNT6     LL_HRTIM_OUT_SetOutputResetSrc\n
  * @rmtoll RSTx1R      TIMEVNT7     LL_HRTIM_OUT_SetOutputResetSrc\n
  * @rmtoll RSTx1R      TIMEVNT8     LL_HRTIM_OUT_SetOutputResetSrc\n
  * @rmtoll RSTx1R      TIMEVNT9     LL_HRTIM_OUT_SetOutputResetSrc\n
  * @rmtoll RSTx1R      EXEVNT1      LL_HRTIM_OUT_SetOutputResetSrc\n
  * @rmtoll RSTx1R      EXEVNT2      LL_HRTIM_OUT_SetOutputResetSrc\n
  * @rmtoll RSTx1R      EXEVNT3      LL_HRTIM_OUT_SetOutputResetSrc\n
  * @rmtoll RSTx1R      EXEVNT4      LL_HRTIM_OUT_SetOutputResetSrc\n
  * @rmtoll RSTx1R      EXEVNT5      LL_HRTIM_OUT_SetOutputResetSrc\n
  * @rmtoll RSTx1R      EXEVNT6      LL_HRTIM_OUT_SetOutputResetSrc\n
  * @rmtoll RSTx1R      EXEVNT7      LL_HRTIM_OUT_SetOutputResetSrc\n
  * @rmtoll RSTx1R      EXEVNT8      LL_HRTIM_OUT_SetOutputResetSrc\n
  * @rmtoll RSTx1R      EXEVNT9      LL_HRTIM_OUT_SetOutputResetSrc\n
  * @rmtoll RSTx1R      EXEVNT10     LL_HRTIM_OUT_SetOutputResetSrc\n
  * @rmtoll RSTx1R      UPDATE       LL_HRTIM_OUT_SetOutputResetSrc
  * @param  HRTIMx High Resolution Timer instance
  * @param  Output This parameter can be one of the following values:
  *         @arg @ref LL_HRTIM_OUTPUT_TA1
  *         @arg @ref LL_HRTIM_OUTPUT_TA2
  *         @arg @ref LL_HRTIM_OUTPUT_TB1
  *         @arg @ref LL_HRTIM_OUTPUT_TB2
  *         @arg @ref LL_HRTIM_OUTPUT_TC1
  *         @arg @ref LL_HRTIM_OUTPUT_TC2
  *         @arg @ref LL_HRTIM_OUTPUT_TD1
  *         @arg @ref LL_HRTIM_OUTPUT_TD2
  *         @arg @ref LL_HRTIM_OUTPUT_TE1
  *         @arg @ref LL_HRTIM_OUTPUT_TE2
  * @param ResetSrc This parameter can be a combination of the following values:
  *         @arg @ref LL_HRTIM_CROSSBAR_NONE
  *         @arg @ref LL_HRTIM_CROSSBAR_RESYNC
  *         @arg @ref LL_HRTIM_CROSSBAR_TIMPER
  *         @arg @ref LL_HRTIM_CROSSBAR_TIMCMP1
  *         @arg @ref LL_HRTIM_CROSSBAR_TIMCMP2
  *         @arg @ref LL_HRTIM_CROSSBAR_TIMCMP3
  *         @arg @ref LL_HRTIM_CROSSBAR_TIMCMP4
  *         @arg @ref LL_HRTIM_CROSSBAR_MASTERPER
  *         @arg @ref LL_HRTIM_CROSSBAR_MASTERCMP1
  *         @arg @ref LL_HRTIM_CROSSBAR_MASTERCMP2
  *         @arg @ref LL_HRTIM_CROSSBAR_MASTERCMP3
  *         @arg @ref LL_HRTIM_CROSSBAR_MASTERCMP4
  *         @arg @ref LL_HRTIM_CROSSBAR_TIMEV_1
  *         @arg @ref LL_HRTIM_CROSSBAR_TIMEV_2
  *         @arg @ref LL_HRTIM_CROSSBAR_TIMEV_3
  *         @arg @ref LL_HRTIM_CROSSBAR_TIMEV_4
  *         @arg @ref LL_HRTIM_CROSSBAR_TIMEV_5
  *         @arg @ref LL_HRTIM_CROSSBAR_TIMEV_6
  *         @arg @ref LL_HRTIM_CROSSBAR_TIMEV_7
  *         @arg @ref LL_HRTIM_CROSSBAR_TIMEV_8
  *         @arg @ref LL_HRTIM_CROSSBAR_TIMEV_9
  *         @arg @ref LL_HRTIM_CROSSBAR_EEV_1
  *         @arg @ref LL_HRTIM_CROSSBAR_EEV_2
  *         @arg @ref LL_HRTIM_CROSSBAR_EEV_3
  *         @arg @ref LL_HRTIM_CROSSBAR_EEV_4
  *         @arg @ref LL_HRTIM_CROSSBAR_EEV_5
  *         @arg @ref LL_HRTIM_CROSSBAR_EEV_6
  *         @arg @ref LL_HRTIM_CROSSBAR_EEV_7
  *         @arg @ref LL_HRTIM_CROSSBAR_EEV_8
  *         @arg @ref LL_HRTIM_CROSSBAR_EEV_9
  *         @arg @ref LL_HRTIM_CROSSBAR_EEV_10
  *         @arg @ref LL_HRTIM_CROSSBAR_UPDATE
  * @retval None
  */
__STATIC_INLINE void LL_HRTIM_OUT_SetOutputResetSrc(HRTIM_TypeDef *HRTIMx, uint32_t Output, uint32_t ResetSrc)
{
  register uint32_t iOutput = (uint8_t)(POSITION_VAL(Output) - POSITION_VAL(LL_HRTIM_OUTPUT_TA1));
  register uint32_t *pReg = (uint32_t *)((uint32_t)((uint32_t)(&HRTIMx->sTimerxRegs[0].RSTx1R) +
                                                    REG_OFFSET_TAB_SETxR[iOutput]));
  WRITE_REG(*pReg, ResetSrc);
}

/**
  * @brief  Get the timer output set source.
  * @rmtoll RSTx1R      RST          LL_HRTIM_OUT_GetOutputResetSrc\n
  * @rmtoll RSTx1R      RESYNC       LL_HRTIM_OUT_GetOutputResetSrc\n
  * @rmtoll RSTx1R      PER          LL_HRTIM_OUT_GetOutputResetSrc\n
  * @rmtoll RSTx1R      CMP1         LL_HRTIM_OUT_GetOutputResetSrc\n
  * @rmtoll RSTx1R      CMP2         LL_HRTIM_OUT_GetOutputResetSrc\n
  * @rmtoll RSTx1R      CMP3         LL_HRTIM_OUT_GetOutputResetSrc\n
  * @rmtoll RSTx1R      CMP4         LL_HRTIM_OUT_GetOutputResetSrc\n
  * @rmtoll RSTx1R      MSTPER       LL_HRTIM_OUT_GetOutputResetSrc\n
  * @rmtoll RSTx1R      MSTCMP1      LL_HRTIM_OUT_GetOutputResetSrc\n
  * @rmtoll RSTx1R      MSTCMP2      LL_HRTIM_OUT_GetOutputResetSrc\n
  * @rmtoll RSTx1R      MSTCMP3      LL_HRTIM_OUT_GetOutputResetSrc\n
  * @rmtoll RSTx1R      MSTCMP4      LL_HRTIM_OUT_GetOutputResetSrc\n
  * @rmtoll RSTx1R      TIMEVNT1     LL_HRTIM_OUT_GetOutputResetSrc\n
  * @rmtoll RSTx1R      TIMEVNT2     LL_HRTIM_OUT_GetOutputResetSrc\n
  * @rmtoll RSTx1R      TIMEVNT3     LL_HRTIM_OUT_GetOutputResetSrc\n
  * @rmtoll RSTx1R      TIMEVNT4     LL_HRTIM_OUT_GetOutputResetSrc\n
  * @rmtoll RSTx1R      TIMEVNT5     LL_HRTIM_OUT_GetOutputResetSrc\n
  * @rmtoll RSTx1R      TIMEVNT6     LL_HRTIM_OUT_GetOutputResetSrc\n
  * @rmtoll RSTx1R      TIMEVNT7     LL_HRTIM_OUT_GetOutputResetSrc\n
  * @rmtoll RSTx1R      TIMEVNT8     LL_HRTIM_OUT_GetOutputResetSrc\n
  * @rmtoll RSTx1R      TIMEVNT9     LL_HRTIM_OUT_GetOutputResetSrc\n
  * @rmtoll RSTx1R      EXEVNT1      LL_HRTIM_OUT_GetOutputResetSrc\n
  * @rmtoll RSTx1R      EXEVNT2      LL_HRTIM_OUT_GetOutputResetSrc\n
  * @rmtoll RSTx1R      EXEVNT3      LL_HRTIM_OUT_GetOutputResetSrc\n
  * @rmtoll RSTx1R      EXEVNT4      LL_HRTIM_OUT_GetOutputResetSrc\n
  * @rmtoll RSTx1R      EXEVNT5      LL_HRTIM_OUT_GetOutputResetSrc\n
  * @rmtoll RSTx1R      EXEVNT6      LL_HRTIM_OUT_GetOutputResetSrc\n
  * @rmtoll RSTx1R      EXEVNT7      LL_HRTIM_OUT_GetOutputResetSrc\n
  * @rmtoll RSTx1R      EXEVNT8      LL_HRTIM_OUT_GetOutputResetSrc\n
  * @rmtoll RSTx1R      EXEVNT9      LL_HRTIM_OUT_GetOutputResetSrc\n
  * @rmtoll RSTx1R      EXEVNT10     LL_HRTIM_OUT_GetOutputResetSrc\n
  * @rmtoll RSTx1R      UPDATE       LL_HRTIM_OUT_GetOutputResetSrc\n
  * @rmtoll RSTx1R      RST          LL_HRTIM_OUT_GetOutputResetSrc\n
  * @rmtoll RSTx1R      RESYNC       LL_HRTIM_OUT_GetOutputResetSrc\n
  * @rmtoll RSTx1R      PER          LL_HRTIM_OUT_GetOutputResetSrc\n
  * @rmtoll RSTx1R      CMP1         LL_HRTIM_OUT_GetOutputResetSrc\n
  * @rmtoll RSTx1R      CMP2         LL_HRTIM_OUT_GetOutputResetSrc\n
  * @rmtoll RSTx1R      CMP3         LL_HRTIM_OUT_GetOutputResetSrc\n
  * @rmtoll RSTx1R      CMP4         LL_HRTIM_OUT_GetOutputResetSrc\n
  * @rmtoll RSTx1R      MSTPER       LL_HRTIM_OUT_GetOutputResetSrc\n
  * @rmtoll RSTx1R      MSTCMP1      LL_HRTIM_OUT_GetOutputResetSrc\n
  * @rmtoll RSTx1R      MSTCMP2      LL_HRTIM_OUT_GetOutputResetSrc\n
  * @rmtoll RSTx1R      MSTCMP3      LL_HRTIM_OUT_GetOutputResetSrc\n
  * @rmtoll RSTx1R      MSTCMP4      LL_HRTIM_OUT_GetOutputResetSrc\n
  * @rmtoll RSTx1R      TIMEVNT1     LL_HRTIM_OUT_GetOutputResetSrc\n
  * @rmtoll RSTx1R      TIMEVNT2     LL_HRTIM_OUT_GetOutputResetSrc\n
  * @rmtoll RSTx1R      TIMEVNT3     LL_HRTIM_OUT_GetOutputResetSrc\n
  * @rmtoll RSTx1R      TIMEVNT4     LL_HRTIM_OUT_GetOutputResetSrc\n
  * @rmtoll RSTx1R      TIMEVNT5     LL_HRTIM_OUT_GetOutputResetSrc\n
  * @rmtoll RSTx1R      TIMEVNT6     LL_HRTIM_OUT_GetOutputResetSrc\n
  * @rmtoll RSTx1R      TIMEVNT7     LL_HRTIM_OUT_GetOutputResetSrc\n
  * @rmtoll RSTx1R      TIMEVNT8     LL_HRTIM_OUT_GetOutputResetSrc\n
  * @rmtoll RSTx1R      TIMEVNT9     LL_HRTIM_OUT_GetOutputResetSrc\n
  * @rmtoll RSTx1R      EXEVNT1      LL_HRTIM_OUT_GetOutputResetSrc\n
  * @rmtoll RSTx1R      EXEVNT2      LL_HRTIM_OUT_GetOutputResetSrc\n
  * @rmtoll RSTx1R      EXEVNT3      LL_HRTIM_OUT_GetOutputResetSrc\n
  * @rmtoll RSTx1R      EXEVNT4      LL_HRTIM_OUT_GetOutputResetSrc\n
  * @rmtoll RSTx1R      EXEVNT5      LL_HRTIM_OUT_GetOutputResetSrc\n
  * @rmtoll RSTx1R      EXEVNT6      LL_HRTIM_OUT_GetOutputResetSrc\n
  * @rmtoll RSTx1R      EXEVNT7      LL_HRTIM_OUT_GetOutputResetSrc\n
  * @rmtoll RSTx1R      EXEVNT8      LL_HRTIM_OUT_GetOutputResetSrc\n
  * @rmtoll RSTx1R      EXEVNT9      LL_HRTIM_OUT_GetOutputResetSrc\n
  * @rmtoll RSTx1R      EXEVNT10     LL_HRTIM_OUT_GetOutputResetSrc\n
  * @rmtoll RSTx1R      UPDATE       LL_HRTIM_OUT_GetOutputResetSrc
  * @param  HRTIMx High Resolution Timer instance
  * @param  Output This parameter can be one of the following values:
  *         @arg @ref LL_HRTIM_OUTPUT_TA1
  *         @arg @ref LL_HRTIM_OUTPUT_TA2
  *         @arg @ref LL_HRTIM_OUTPUT_TB1
  *         @arg @ref LL_HRTIM_OUTPUT_TB2
  *         @arg @ref LL_HRTIM_OUTPUT_TC1
  *         @arg @ref LL_HRTIM_OUTPUT_TC2
  *         @arg @ref LL_HRTIM_OUTPUT_TD1
  *         @arg @ref LL_HRTIM_OUTPUT_TD2
  *         @arg @ref LL_HRTIM_OUTPUT_TE1
  *         @arg @ref LL_HRTIM_OUTPUT_TE2
  * @retval ResetSrc This parameter can be a combination of the following values:
  *         @arg @ref LL_HRTIM_CROSSBAR_NONE
  *         @arg @ref LL_HRTIM_CROSSBAR_RESYNC
  *         @arg @ref LL_HRTIM_CROSSBAR_TIMPER
  *         @arg @ref LL_HRTIM_CROSSBAR_TIMCMP1
  *         @arg @ref LL_HRTIM_CROSSBAR_TIMCMP2
  *         @arg @ref LL_HRTIM_CROSSBAR_TIMCMP3
  *         @arg @ref LL_HRTIM_CROSSBAR_TIMCMP4
  *         @arg @ref LL_HRTIM_CROSSBAR_MASTERPER
  *         @arg @ref LL_HRTIM_CROSSBAR_MASTERCMP1
  *         @arg @ref LL_HRTIM_CROSSBAR_MASTERCMP2
  *         @arg @ref LL_HRTIM_CROSSBAR_MASTERCMP3
  *         @arg @ref LL_HRTIM_CROSSBAR_MASTERCMP4
  *         @arg @ref LL_HRTIM_CROSSBAR_TIMEV_1
  *         @arg @ref LL_HRTIM_CROSSBAR_TIMEV_2
  *         @arg @ref LL_HRTIM_CROSSBAR_TIMEV_3
  *         @arg @ref LL_HRTIM_CROSSBAR_TIMEV_4
  *         @arg @ref LL_HRTIM_CROSSBAR_TIMEV_5
  *         @arg @ref LL_HRTIM_CROSSBAR_TIMEV_6
  *         @arg @ref LL_HRTIM_CROSSBAR_TIMEV_7
  *         @arg @ref LL_HRTIM_CROSSBAR_TIMEV_8
  *         @arg @ref LL_HRTIM_CROSSBAR_TIMEV_9
  *         @arg @ref LL_HRTIM_CROSSBAR_EEV_1
  *         @arg @ref LL_HRTIM_CROSSBAR_EEV_2
  *         @arg @ref LL_HRTIM_CROSSBAR_EEV_3
  *         @arg @ref LL_HRTIM_CROSSBAR_EEV_4
  *         @arg @ref LL_HRTIM_CROSSBAR_EEV_5
  *         @arg @ref LL_HRTIM_CROSSBAR_EEV_6
  *         @arg @ref LL_HRTIM_CROSSBAR_EEV_7
  *         @arg @ref LL_HRTIM_CROSSBAR_EEV_8
  *         @arg @ref LL_HRTIM_CROSSBAR_EEV_9
  *         @arg @ref LL_HRTIM_CROSSBAR_EEV_10
  *         @arg @ref LL_HRTIM_CROSSBAR_UPDATE
  */
__STATIC_INLINE uint32_t LL_HRTIM_OUT_GetOutputResetSrc(HRTIM_TypeDef *HRTIMx, uint32_t Output)
{
  register uint32_t iOutput = (uint8_t)(POSITION_VAL(Output) - POSITION_VAL(LL_HRTIM_OUTPUT_TA1));
  register uint32_t *pReg = (uint32_t *)((uint32_t)((uint32_t)(&HRTIMx->sTimerxRegs[0].RSTx1R) +
                                                    REG_OFFSET_TAB_SETxR[iOutput]));
  return (uint32_t) READ_REG(*pReg);
}

/**
  * @brief  Configure a timer output.
  * @rmtoll OUTxR      POL1          LL_HRTIM_OUT_Config\n
  * @rmtoll OUTxR      IDLEM1        LL_HRTIM_OUT_Config\n
  * @rmtoll OUTxR      IDLES1        LL_HRTIM_OUT_Config\n
  * @rmtoll OUTxR      FAULT1        LL_HRTIM_OUT_Config\n
  * @rmtoll OUTxR      CHP1          LL_HRTIM_OUT_Config\n
  * @rmtoll OUTxR      DIDL1         LL_HRTIM_OUT_Config\n
  * @rmtoll OUTxR      POL2          LL_HRTIM_OUT_Config\n
  * @rmtoll OUTxR      IDLEM2        LL_HRTIM_OUT_Config\n
  * @rmtoll OUTxR      IDLES2        LL_HRTIM_OUT_Config\n
  * @rmtoll OUTxR      FAULT2        LL_HRTIM_OUT_Config\n
  * @rmtoll OUTxR      CHP2          LL_HRTIM_OUT_Config\n
  * @rmtoll OUTxR      DIDL2         LL_HRTIM_OUT_Config
  * @param  HRTIMx High Resolution Timer instance
  * @param  Output This parameter can be one of the following values:
  *         @arg @ref LL_HRTIM_OUTPUT_TA1
  *         @arg @ref LL_HRTIM_OUTPUT_TA2
  *         @arg @ref LL_HRTIM_OUTPUT_TB1
  *         @arg @ref LL_HRTIM_OUTPUT_TB2
  *         @arg @ref LL_HRTIM_OUTPUT_TC1
  *         @arg @ref LL_HRTIM_OUTPUT_TC2
  *         @arg @ref LL_HRTIM_OUTPUT_TD1
  *         @arg @ref LL_HRTIM_OUTPUT_TD2
  *         @arg @ref LL_HRTIM_OUTPUT_TE1
  *         @arg @ref LL_HRTIM_OUTPUT_TE2
  * @param  Configuration This parameter must be a combination of all the following values:
  *         @arg @ref LL_HRTIM_OUT_POSITIVE_POLARITY or @ref LL_HRTIM_OUT_NEGATIVE_POLARITY
  *         @arg @ref LL_HRTIM_OUT_NO_IDLE or @ref LL_HRTIM_OUT_IDLE_WHEN_BURST
  *         @arg @ref LL_HRTIM_OUT_IDLELEVEL_INACTIVE or @ref LL_HRTIM_OUT_IDLELEVEL_ACTIVE
  *         @arg @ref LL_HRTIM_OUT_FAULTSTATE_NO_ACTION or @ref LL_HRTIM_OUT_FAULTSTATE_ACTIVE or @ref LL_HRTIM_OUT_FAULTSTATE_INACTIVE or @ref LL_HRTIM_OUT_FAULTSTATE_HIGHZ
  *         @arg @ref LL_HRTIM_OUT_CHOPPERMODE_DISABLED or @ref LL_HRTIM_OUT_CHOPPERMODE_ENABLED
  *         @arg @ref LL_HRTIM_OUT_BM_ENTRYMODE_REGULAR or @ref LL_HRTIM_OUT_BM_ENTRYMODE_DELAYED
  * @retval None
  */
__STATIC_INLINE void LL_HRTIM_OUT_Config(HRTIM_TypeDef *HRTIMx, uint32_t Output, uint32_t Configuration)
{
  register uint32_t iOutput = (uint8_t)(POSITION_VAL(Output) - POSITION_VAL(LL_HRTIM_OUTPUT_TA1));
  register uint32_t *pReg = (uint32_t *)((uint32_t)((uint32_t)(&HRTIMx->sTimerxRegs[0].OUTxR) +
                                                    REG_OFFSET_TAB_OUTxR[iOutput]));
  MODIFY_REG(*pReg, (HRTIM_OUT_CONFIG_MASK << REG_SHIFT_TAB_OUTxR[iOutput]),
             (Configuration << REG_SHIFT_TAB_OUTxR[iOutput]));
}

