zephyrproject-rtos/zephyr/ext/hal/st/stm32cube/stm32f3xx/drivers/include/stm32f3xx_ll_hrtim.h
/**
  * @brief  Configure external event conditioning.
  * @rmtoll EECR1     EE1SRC          LL_HRTIM_EE_Config\n
  * @rmtoll EECR1     EE1POL          LL_HRTIM_EE_Config\n
  * @rmtoll EECR1     EE1SNS          LL_HRTIM_EE_Config\n
  * @rmtoll EECR1     EE1FAST         LL_HRTIM_EE_Config\n
  * @rmtoll EECR1     EE2SRC          LL_HRTIM_EE_Config\n
  * @rmtoll EECR1     EE2POL          LL_HRTIM_EE_Config\n
  * @rmtoll EECR1     EE2SNS          LL_HRTIM_EE_Config\n
  * @rmtoll EECR1     EE2FAST         LL_HRTIM_EE_Config\n
  * @rmtoll EECR1     EE3SRC          LL_HRTIM_EE_Config\n
  * @rmtoll EECR1     EE3POL          LL_HRTIM_EE_Config\n
  * @rmtoll EECR1     EE3SNS          LL_HRTIM_EE_Config\n
  * @rmtoll EECR1     EE3FAST         LL_HRTIM_EE_Config\n
  * @rmtoll EECR1     EE4SRC          LL_HRTIM_EE_Config\n
  * @rmtoll EECR1     EE4POL          LL_HRTIM_EE_Config\n
  * @rmtoll EECR1     EE4SNS          LL_HRTIM_EE_Config\n
  * @rmtoll EECR1     EE4FAST         LL_HRTIM_EE_Config\n
  * @rmtoll EECR1     EE5SRC          LL_HRTIM_EE_Config\n
  * @rmtoll EECR1     EE5POL          LL_HRTIM_EE_Config\n
  * @rmtoll EECR1     EE5SNS          LL_HRTIM_EE_Config\n
  * @rmtoll EECR1     EE5FAST         LL_HRTIM_EE_Config\n
  * @rmtoll EECR2     EE6SRC          LL_HRTIM_EE_Config\n
  * @rmtoll EECR2     EE6POL          LL_HRTIM_EE_Config\n
  * @rmtoll EECR2     EE6SNS          LL_HRTIM_EE_Config\n
  * @rmtoll EECR2     EE6FAST         LL_HRTIM_EE_Config\n
  * @rmtoll EECR2     EE7SRC          LL_HRTIM_EE_Config\n
  * @rmtoll EECR2     EE7POL          LL_HRTIM_EE_Config\n
  * @rmtoll EECR2     EE7SNS          LL_HRTIM_EE_Config\n
  * @rmtoll EECR2     EE7FAST         LL_HRTIM_EE_Config\n
  * @rmtoll EECR2     EE8SRC          LL_HRTIM_EE_Config\n
  * @rmtoll EECR2     EE8POL          LL_HRTIM_EE_Config\n
  * @rmtoll EECR2     EE8SNS          LL_HRTIM_EE_Config\n
  * @rmtoll EECR2     EE8FAST         LL_HRTIM_EE_Config\n
  * @rmtoll EECR2     EE9SRC          LL_HRTIM_EE_Config\n
  * @rmtoll EECR2     EE9POL          LL_HRTIM_EE_Config\n
  * @rmtoll EECR2     EE9SNS          LL_HRTIM_EE_Config\n
  * @rmtoll EECR2     EE9FAST         LL_HRTIM_EE_Config\n
  * @rmtoll EECR2     EE10SRC         LL_HRTIM_EE_Config\n
  * @rmtoll EECR2     EE10POL         LL_HRTIM_EE_Config\n
  * @rmtoll EECR2     EE10SNS         LL_HRTIM_EE_Config\n
  * @rmtoll EECR2     EE10FAST        LL_HRTIM_EE_Config
  * @note This function must not be called when the timer counter is enabled.
  * @note Event source (EExSrc1..EExSRC4) mapping depends on configured event channel.
  * @note Fast mode is available only for LL_HRTIM_EVENT_1..5.
  * @param  HRTIMx High Resolution Timer instance
  * @param  Event This parameter can be one of the following values:
  *         @arg @ref LL_HRTIM_EVENT_1
  *         @arg @ref LL_HRTIM_EVENT_2
  *         @arg @ref LL_HRTIM_EVENT_3
  *         @arg @ref LL_HRTIM_EVENT_4
  *         @arg @ref LL_HRTIM_EVENT_5
  *         @arg @ref LL_HRTIM_EVENT_6
  *         @arg @ref LL_HRTIM_EVENT_7
  *         @arg @ref LL_HRTIM_EVENT_8
  *         @arg @ref LL_HRTIM_EVENT_9
  *         @arg @ref LL_HRTIM_EVENT_10
  * @param  Configuration This parameter must be a combination of all the following values:
  *         @arg @ref LL_HRTIM_EE_SRC_1 or @ref LL_HRTIM_EE_SRC_2 or @ref LL_HRTIM_EE_SRC_3 or @ref LL_HRTIM_EE_SRC_4
  *         @arg @ref LL_HRTIM_EE_POLARITY_HIGH or @ref LL_HRTIM_EE_POLARITY_LOW
  *         @arg @ref LL_HRTIM_EE_SENSITIVITY_LEVEL or @ref LL_HRTIM_EE_SENSITIVITY_RISINGEDGE or @ref LL_HRTIM_EE_SENSITIVITY_FALLINGEDGE or @ref LL_HRTIM_EE_SENSITIVITY_BOTHEDGES
  *         @arg @ref LL_HRTIM_EE_FASTMODE_DISABLE or @ref LL_HRTIM_EE_FASTMODE_ENABLE
  * @retval None
  */
__STATIC_INLINE void LL_HRTIM_EE_Config(HRTIM_TypeDef *HRTIMx, uint32_t Event, uint32_t Configuration)
{
  register uint32_t iEvent = (uint8_t)(POSITION_VAL(Event) - POSITION_VAL(LL_HRTIM_EVENT_1));
  register uint32_t *pReg = (uint32_t *)((uint32_t)((uint32_t)(&HRTIMx->sCommonRegs.EECR1) +
                                                    REG_OFFSET_TAB_EECR[iEvent]));
  MODIFY_REG(*pReg, (HRTIM_EE_CONFIG_MASK << REG_SHIFT_TAB_EExSRC[iEvent]),
             (Configuration << REG_SHIFT_TAB_EExSRC[iEvent]));
}

/**
  * @brief  Set the external event source.
  * @rmtoll EECR1     EE1SRC          LL_HRTIM_EE_SetSrc\n
  * @rmtoll EECR1     EE2SRC          LL_HRTIM_EE_SetSrc\n
  * @rmtoll EECR1     EE3SRC          LL_HRTIM_EE_SetSrc\n
  * @rmtoll EECR1     EE4SRC          LL_HRTIM_EE_SetSrc\n
  * @rmtoll EECR1     EE5SRC          LL_HRTIM_EE_SetSrc\n
  * @rmtoll EECR2     EE6SRC          LL_HRTIM_EE_SetSrc\n
  * @rmtoll EECR2     EE7SRC          LL_HRTIM_EE_SetSrc\n
  * @rmtoll EECR2     EE8SRC          LL_HRTIM_EE_SetSrc\n
  * @rmtoll EECR2     EE9SRC          LL_HRTIM_EE_SetSrc\n
  * @rmtoll EECR2     EE10SRC         LL_HRTIM_EE_SetSrc
  * @param  HRTIMx High Resolution Timer instance
  * @param  Event This parameter can be one of the following values:
  *         @arg @ref LL_HRTIM_EVENT_1
  *         @arg @ref LL_HRTIM_EVENT_2
  *         @arg @ref LL_HRTIM_EVENT_3
  *         @arg @ref LL_HRTIM_EVENT_4
  *         @arg @ref LL_HRTIM_EVENT_5
  *         @arg @ref LL_HRTIM_EVENT_6
  *         @arg @ref LL_HRTIM_EVENT_7
  *         @arg @ref LL_HRTIM_EVENT_8
  *         @arg @ref LL_HRTIM_EVENT_9
  *         @arg @ref LL_HRTIM_EVENT_10
  * @param  Src This parameter can be one of the following values:
  *         @arg @ref LL_HRTIM_EE_SRC_1
  *         @arg @ref LL_HRTIM_EE_SRC_2
  *         @arg @ref LL_HRTIM_EE_SRC_3
  *         @arg @ref LL_HRTIM_EE_SRC_4
  * @retval None
  */
__STATIC_INLINE void LL_HRTIM_EE_SetSrc(HRTIM_TypeDef *HRTIMx, uint32_t Event, uint32_t Src)
{
  register uint32_t iEvent = (uint8_t)(POSITION_VAL(Event) - POSITION_VAL(LL_HRTIM_EVENT_1));
  register uint32_t *pReg = (uint32_t *)((uint32_t)((uint32_t)(&HRTIMx->sCommonRegs.EECR1) +
                                                    REG_OFFSET_TAB_EECR[iEvent]));
  MODIFY_REG(*pReg, (HRTIM_EECR1_EE1SRC << REG_SHIFT_TAB_EExSRC[iEvent]), (Src << REG_SHIFT_TAB_EExSRC[iEvent]));
}

/**
  * @brief  Get actual external event source.
  * @rmtoll EECR1     EE1SRC          LL_HRTIM_EE_GetSrc\n
  * @rmtoll EECR1     EE2SRC          LL_HRTIM_EE_GetSrc\n
  * @rmtoll EECR1     EE3SRC          LL_HRTIM_EE_GetSrc\n
  * @rmtoll EECR1     EE4SRC          LL_HRTIM_EE_GetSrc\n
  * @rmtoll EECR1     EE5SRC          LL_HRTIM_EE_GetSrc\n
  * @rmtoll EECR2     EE6SRC          LL_HRTIM_EE_GetSrc\n
  * @rmtoll EECR2     EE7SRC          LL_HRTIM_EE_GetSrc\n
  * @rmtoll EECR2     EE8SRC          LL_HRTIM_EE_GetSrc\n
  * @rmtoll EECR2     EE9SRC          LL_HRTIM_EE_GetSrc\n
  * @rmtoll EECR2     EE10SRC         LL_HRTIM_EE_GetSrc
  * @param  HRTIMx High Resolution Timer instance
  * @param  Event This parameter can be one of the following values:
  *         @arg @ref LL_HRTIM_EVENT_1
  *         @arg @ref LL_HRTIM_EVENT_2
  *         @arg @ref LL_HRTIM_EVENT_3
  *         @arg @ref LL_HRTIM_EVENT_4
  *         @arg @ref LL_HRTIM_EVENT_5
  *         @arg @ref LL_HRTIM_EVENT_6
  *         @arg @ref LL_HRTIM_EVENT_7
  *         @arg @ref LL_HRTIM_EVENT_8
  *         @arg @ref LL_HRTIM_EVENT_9
  *         @arg @ref LL_HRTIM_EVENT_10
  * @retval EventSrc This parameter can be one of the following values:
  *         @arg @ref LL_HRTIM_EE_SRC_1
  *         @arg @ref LL_HRTIM_EE_SRC_2
  *         @arg @ref LL_HRTIM_EE_SRC_3
  *         @arg @ref LL_HRTIM_EE_SRC_4
  */
__STATIC_INLINE uint32_t LL_HRTIM_EE_GetSrc(HRTIM_TypeDef *HRTIMx, uint32_t Event)
{
  register uint32_t iEvent = (uint8_t)(POSITION_VAL(Event) - POSITION_VAL(LL_HRTIM_EVENT_1));
  register uint32_t *pReg = (uint32_t *)((uint32_t)((uint32_t)(&HRTIMx->sCommonRegs.EECR1) +
                                                    REG_OFFSET_TAB_EECR[iEvent]));
  return (READ_BIT(*pReg, HRTIM_EECR1_EE1SRC << REG_SHIFT_TAB_EExSRC[iEvent]) >>  REG_SHIFT_TAB_EExSRC[iEvent]);
}

/**
  * @brief  Set the polarity of an external event.
  * @rmtoll EECR1     EE1POL          LL_HRTIM_EE_SetPolarity\n
  * @rmtoll EECR1     EE2POL          LL_HRTIM_EE_SetPolarity\n
  * @rmtoll EECR1     EE3POL          LL_HRTIM_EE_SetPolarity\n
  * @rmtoll EECR1     EE4POL          LL_HRTIM_EE_SetPolarity\n
  * @rmtoll EECR1     EE5POL          LL_HRTIM_EE_SetPolarity\n
  * @rmtoll EECR2     EE6POL          LL_HRTIM_EE_SetPolarity\n
  * @rmtoll EECR2     EE7POL          LL_HRTIM_EE_SetPolarity\n
  * @rmtoll EECR2     EE8POL          LL_HRTIM_EE_SetPolarity\n
  * @rmtoll EECR2     EE9POL          LL_HRTIM_EE_SetPolarity\n
  * @rmtoll EECR2     EE10POL         LL_HRTIM_EE_SetPolarity
  * @note This function must not be called when the timer counter is enabled.
  * @note Event polarity is only significant when event detection is level-sensitive.
  * @param  HRTIMx High Resolution Timer instance
  * @param  Event This parameter can be one of the following values:
  *         @arg @ref LL_HRTIM_EVENT_1
  *         @arg @ref LL_HRTIM_EVENT_2
  *         @arg @ref LL_HRTIM_EVENT_3
  *         @arg @ref LL_HRTIM_EVENT_4
  *         @arg @ref LL_HRTIM_EVENT_5
  *         @arg @ref LL_HRTIM_EVENT_6
  *         @arg @ref LL_HRTIM_EVENT_7
  *         @arg @ref LL_HRTIM_EVENT_8
  *         @arg @ref LL_HRTIM_EVENT_9
  *         @arg @ref LL_HRTIM_EVENT_10
  * @param  Polarity This parameter can be one of the following values:
  *         @arg @ref LL_HRTIM_EE_POLARITY_HIGH
  *         @arg @ref LL_HRTIM_EE_POLARITY_LOW
  * @retval None
  */
__STATIC_INLINE void LL_HRTIM_EE_SetPolarity(HRTIM_TypeDef *HRTIMx, uint32_t Event, uint32_t Polarity)
{
  register uint32_t iEvent = (uint8_t)(POSITION_VAL(Event) - POSITION_VAL(LL_HRTIM_EVENT_1));
  register uint32_t *pReg = (uint32_t *)((uint32_t)((uint32_t)(&HRTIMx->sCommonRegs.EECR1) +
                                                    REG_OFFSET_TAB_EECR[iEvent]));
  MODIFY_REG(*pReg, (HRTIM_EECR1_EE1POL << REG_SHIFT_TAB_EExSRC[iEvent]), (Polarity << REG_SHIFT_TAB_EExSRC[iEvent]));
}

/**
  * @brief  Get actual polarity setting of an external event.
  * @rmtoll EECR1     EE1POL          LL_HRTIM_EE_GetPolarity\n
  * @rmtoll EECR1     EE2POL          LL_HRTIM_EE_GetPolarity\n
  * @rmtoll EECR1     EE3POL          LL_HRTIM_EE_GetPolarity\n
  * @rmtoll EECR1     EE4POL          LL_HRTIM_EE_GetPolarity\n
  * @rmtoll EECR1     EE5POL          LL_HRTIM_EE_GetPolarity\n
  * @rmtoll EECR2     EE6POL          LL_HRTIM_EE_GetPolarity\n
  * @rmtoll EECR2     EE7POL          LL_HRTIM_EE_GetPolarity\n
  * @rmtoll EECR2     EE8POL          LL_HRTIM_EE_GetPolarity\n
  * @rmtoll EECR2     EE9POL          LL_HRTIM_EE_GetPolarity\n
  * @rmtoll EECR2     EE10POL         LL_HRTIM_EE_GetPolarity
  * @param  HRTIMx High Resolution Timer instance
  * @param  Event This parameter can be one of the following values:
  *         @arg @ref LL_HRTIM_EVENT_1
  *         @arg @ref LL_HRTIM_EVENT_2
  *         @arg @ref LL_HRTIM_EVENT_3
  *         @arg @ref LL_HRTIM_EVENT_4
  *         @arg @ref LL_HRTIM_EVENT_5
  *         @arg @ref LL_HRTIM_EVENT_6
  *         @arg @ref LL_HRTIM_EVENT_7
  *         @arg @ref LL_HRTIM_EVENT_8
  *         @arg @ref LL_HRTIM_EVENT_9
  *         @arg @ref LL_HRTIM_EVENT_10
  * @retval Polarity This parameter can be one of the following values:
  *         @arg @ref LL_HRTIM_EE_POLARITY_HIGH
  *         @arg @ref LL_HRTIM_EE_POLARITY_LOW
  */
__STATIC_INLINE uint32_t LL_HRTIM_EE_GetPolarity(HRTIM_TypeDef *HRTIMx, uint32_t Event)
{
  register uint32_t iEvent = (uint8_t)(POSITION_VAL(Event) - POSITION_VAL(LL_HRTIM_EVENT_1));
  register uint32_t *pReg = (uint32_t *)((uint32_t)((uint32_t)(&HRTIMx->sCommonRegs.EECR1) +
                                                    REG_OFFSET_TAB_EECR[iEvent]));
  return (READ_BIT(*pReg, HRTIM_EECR1_EE1POL << REG_SHIFT_TAB_EExSRC[iEvent]) >>  REG_SHIFT_TAB_EExSRC[iEvent]);
}

/**
  * @brief  Set the sensitivity of an external event.
  * @rmtoll EECR1     EE1SNS          LL_HRTIM_EE_SetSensitivity\n
  * @rmtoll EECR1     EE2SNS          LL_HRTIM_EE_SetSensitivity\n
  * @rmtoll EECR1     EE3SNS          LL_HRTIM_EE_SetSensitivity\n
  * @rmtoll EECR1     EE4SNS          LL_HRTIM_EE_SetSensitivity\n
  * @rmtoll EECR1     EE5SNS          LL_HRTIM_EE_SetSensitivity\n
  * @rmtoll EECR2     EE6SNS          LL_HRTIM_EE_SetSensitivity\n
  * @rmtoll EECR2     EE7SNS          LL_HRTIM_EE_SetSensitivity\n
  * @rmtoll EECR2     EE8SNS          LL_HRTIM_EE_SetSensitivity\n
  * @rmtoll EECR2     EE9SNS          LL_HRTIM_EE_SetSensitivity\n
  * @rmtoll EECR2     EE10SNS         LL_HRTIM_EE_SetSensitivity
  * @param  HRTIMx High Resolution Timer instance
  * @param  Event This parameter can be one of the following values:
  *         @arg @ref LL_HRTIM_EVENT_1
  *         @arg @ref LL_HRTIM_EVENT_2
  *         @arg @ref LL_HRTIM_EVENT_3
  *         @arg @ref LL_HRTIM_EVENT_4
  *         @arg @ref LL_HRTIM_EVENT_5
  *         @arg @ref LL_HRTIM_EVENT_6
  *         @arg @ref LL_HRTIM_EVENT_7
  *         @arg @ref LL_HRTIM_EVENT_8
  *         @arg @ref LL_HRTIM_EVENT_9
  *         @arg @ref LL_HRTIM_EVENT_10
  * @param  Sensitivity This parameter can be one of the following values:
  *         @arg @ref LL_HRTIM_EE_SENSITIVITY_LEVEL
  *         @arg @ref LL_HRTIM_EE_SENSITIVITY_RISINGEDGE
  *         @arg @ref LL_HRTIM_EE_SENSITIVITY_FALLINGEDGE
  *         @arg @ref LL_HRTIM_EE_SENSITIVITY_BOTHEDGES
  * @retval None
  */

__STATIC_INLINE void LL_HRTIM_EE_SetSensitivity(HRTIM_TypeDef *HRTIMx, uint32_t Event, uint32_t Sensitivity)
{
  register uint32_t iEvent = (uint8_t)(POSITION_VAL(Event) - POSITION_VAL(LL_HRTIM_EVENT_1));
  register uint32_t *pReg = (uint32_t *)((uint32_t)((uint32_t)(&HRTIMx->sCommonRegs.EECR1) +
                                                    REG_OFFSET_TAB_EECR[iEvent]));
  MODIFY_REG(*pReg, (HRTIM_EECR1_EE1SNS << REG_SHIFT_TAB_EExSRC[iEvent]), (Sensitivity << REG_SHIFT_TAB_EExSRC[iEvent]));
}

/**
  * @brief  Get actual sensitivity setting of an external event.
  * @rmtoll EECR1     EE1SNS          LL_HRTIM_EE_GetSensitivity\n
  * @rmtoll EECR1     EE2SNS          LL_HRTIM_EE_GetSensitivity\n
  * @rmtoll EECR1     EE3SNS          LL_HRTIM_EE_GetSensitivity\n
  * @rmtoll EECR1     EE4SNS          LL_HRTIM_EE_GetSensitivity\n
  * @rmtoll EECR1     EE5SNS          LL_HRTIM_EE_GetSensitivity\n
  * @rmtoll EECR2     EE6SNS          LL_HRTIM_EE_GetSensitivity\n
  * @rmtoll EECR2     EE7SNS          LL_HRTIM_EE_GetSensitivity\n
  * @rmtoll EECR2     EE8SNS          LL_HRTIM_EE_GetSensitivity\n
  * @rmtoll EECR2     EE9SNS          LL_HRTIM_EE_GetSensitivity\n
  * @rmtoll EECR2     EE10SNS         LL_HRTIM_EE_GetSensitivity
  * @param  HRTIMx High Resolution Timer instance
  * @param  Event This parameter can be one of the following values:
  *         @arg @ref LL_HRTIM_EVENT_1
  *         @arg @ref LL_HRTIM_EVENT_2
  *         @arg @ref LL_HRTIM_EVENT_3
  *         @arg @ref LL_HRTIM_EVENT_4
  *         @arg @ref LL_HRTIM_EVENT_5
  *         @arg @ref LL_HRTIM_EVENT_6
  *         @arg @ref LL_HRTIM_EVENT_7
  *         @arg @ref LL_HRTIM_EVENT_8
  *         @arg @ref LL_HRTIM_EVENT_9
  *         @arg @ref LL_HRTIM_EVENT_10
  * @retval Polarity This parameter can be one of the following values:
  *         @arg @ref LL_HRTIM_EE_SENSITIVITY_LEVEL
  *         @arg @ref LL_HRTIM_EE_SENSITIVITY_RISINGEDGE
  *         @arg @ref LL_HRTIM_EE_SENSITIVITY_FALLINGEDGE
  *         @arg @ref LL_HRTIM_EE_SENSITIVITY_BOTHEDGES
  */
__STATIC_INLINE uint32_t LL_HRTIM_EE_GetSensitivity(HRTIM_TypeDef *HRTIMx, uint32_t Event)
{
  register uint32_t iEvent = (uint8_t)(POSITION_VAL(Event) - POSITION_VAL(LL_HRTIM_EVENT_1));
  register uint32_t *pReg = (uint32_t *)((uint32_t)((uint32_t)(&HRTIMx->sCommonRegs.EECR1) +
                                                    REG_OFFSET_TAB_EECR[iEvent]));
  return (READ_BIT(*pReg, HRTIM_EECR1_EE1SNS << REG_SHIFT_TAB_EExSRC[iEvent]) >>  REG_SHIFT_TAB_EExSRC[iEvent]);
}

/**
  * @brief  Set the fast mode of an external event.
  * @rmtoll EECR1     EE1FAST         LL_HRTIM_EE_SetFastMode\n
  * @rmtoll EECR1     EE2FAST         LL_HRTIM_EE_SetFastMode\n
  * @rmtoll EECR1     EE3FAST         LL_HRTIM_EE_SetFastMode\n
  * @rmtoll EECR1     EE4FAST         LL_HRTIM_EE_SetFastMode\n
  * @rmtoll EECR1     EE5FAST         LL_HRTIM_EE_SetFastMode\n
  * @rmtoll EECR2     EE6FAST         LL_HRTIM_EE_SetFastMode\n
  * @rmtoll EECR2     EE7FAST         LL_HRTIM_EE_SetFastMode\n
  * @rmtoll EECR2     EE8FAST         LL_HRTIM_EE_SetFastMode\n
  * @rmtoll EECR2     EE9FAST         LL_HRTIM_EE_SetFastMode\n
  * @rmtoll EECR2     EE10FAST        LL_HRTIM_EE_SetFastMode
  * @note This function must not be called when the timer counter is enabled.
  * @param  HRTIMx High Resolution Timer instance
  * @param  Event This parameter can be one of the following values:
  *         @arg @ref LL_HRTIM_EVENT_1
  *         @arg @ref LL_HRTIM_EVENT_2
  *         @arg @ref LL_HRTIM_EVENT_3
  *         @arg @ref LL_HRTIM_EVENT_4
  *         @arg @ref LL_HRTIM_EVENT_5
  * @param  FastMode This parameter can be one of the following values:
  *         @arg @ref LL_HRTIM_EE_FASTMODE_DISABLE
  *         @arg @ref LL_HRTIM_EE_FASTMODE_ENABLE
  * @retval None
  */
__STATIC_INLINE void LL_HRTIM_EE_SetFastMode(HRTIM_TypeDef *HRTIMx, uint32_t Event, uint32_t FastMode)
{
  register uint32_t iEvent = (uint8_t)(POSITION_VAL(Event) - POSITION_VAL(LL_HRTIM_EVENT_1));
  register uint32_t *pReg = (uint32_t *)((uint32_t)((uint32_t)(&HRTIMx->sCommonRegs.EECR1) +
                                                    REG_OFFSET_TAB_EECR[iEvent]));
  MODIFY_REG(*pReg, (HRTIM_EECR1_EE1FAST << REG_SHIFT_TAB_EExSRC[iEvent]), (FastMode << REG_SHIFT_TAB_EExSRC[iEvent]));
}

/**
  * @brief  Get actual fast mode setting of an external event.
  * @rmtoll EECR1     EE1FAST         LL_HRTIM_EE_GetFastMode\n
  * @rmtoll EECR1     EE2FAST         LL_HRTIM_EE_GetFastMode\n
  * @rmtoll EECR1     EE3FAST         LL_HRTIM_EE_GetFastMode\n
  * @rmtoll EECR1     EE4FAST         LL_HRTIM_EE_GetFastMode\n
  * @rmtoll EECR1     EE5FAST         LL_HRTIM_EE_GetFastMode\n
  * @rmtoll EECR2     EE6FAST         LL_HRTIM_EE_GetFastMode\n
  * @rmtoll EECR2     EE7FAST         LL_HRTIM_EE_GetFastMode\n
  * @rmtoll EECR2     EE8FAST         LL_HRTIM_EE_GetFastMode\n
  * @rmtoll EECR2     EE9FAST         LL_HRTIM_EE_GetFastMode\n
  * @rmtoll EECR2     EE10FAST        LL_HRTIM_EE_GetFastMode
  * @param  HRTIMx High Resolution Timer instance
  * @param  Event This parameter can be one of the following values:
  *         @arg @ref LL_HRTIM_EVENT_1
  *         @arg @ref LL_HRTIM_EVENT_2
  *         @arg @ref LL_HRTIM_EVENT_3
  *         @arg @ref LL_HRTIM_EVENT_4
  *         @arg @ref LL_HRTIM_EVENT_5
  * @retval FastMode This parameter can be one of the following values:
  *         @arg @ref LL_HRTIM_EE_FASTMODE_DISABLE
  *         @arg @ref LL_HRTIM_EE_FASTMODE_ENABLE
  */
__STATIC_INLINE uint32_t LL_HRTIM_EE_GetFastMode(HRTIM_TypeDef *HRTIMx, uint32_t Event)
{
  register uint32_t iEvent = (uint8_t)(POSITION_VAL(Event) - POSITION_VAL(LL_HRTIM_EVENT_1));
  register uint32_t *pReg = (uint32_t *)((uint32_t)((uint32_t)(&HRTIMx->sCommonRegs.EECR1) +
                                                    REG_OFFSET_TAB_EECR[iEvent]));
  return (READ_BIT(*pReg, HRTIM_EECR1_EE1FAST << REG_SHIFT_TAB_EExSRC[iEvent]) >>  REG_SHIFT_TAB_EExSRC[iEvent]);
}

/**
  * @brief  Set the digital noise filter of a external event.
  * @rmtoll EECR3     EE6F         LL_HRTIM_EE_SetFilter\n
  * @rmtoll EECR3     EE7F         LL_HRTIM_EE_SetFilter\n
  * @rmtoll EECR3     EE8F         LL_HRTIM_EE_SetFilter\n
  * @rmtoll EECR3     EE9F         LL_HRTIM_EE_SetFilter\n
  * @rmtoll EECR3     EE10F        LL_HRTIM_EE_SetFilter
  * @param  HRTIMx High Resolution Timer instance
  * @param  Event This parameter can be one of the following values:
  *         @arg @ref LL_HRTIM_EVENT_6
  *         @arg @ref LL_HRTIM_EVENT_7
  *         @arg @ref LL_HRTIM_EVENT_8
  *         @arg @ref LL_HRTIM_EVENT_9
  *         @arg @ref LL_HRTIM_EVENT_10
  * @param  Filter This parameter can be one of the following values:
  *         @arg @ref LL_HRTIM_EE_FILTER_NONE
  *         @arg @ref LL_HRTIM_EE_FILTER_1
  *         @arg @ref LL_HRTIM_EE_FILTER_2
  *         @arg @ref LL_HRTIM_EE_FILTER_3
  *         @arg @ref LL_HRTIM_EE_FILTER_4
  *         @arg @ref LL_HRTIM_EE_FILTER_5
  *         @arg @ref LL_HRTIM_EE_FILTER_6
  *         @arg @ref LL_HRTIM_EE_FILTER_7
  *         @arg @ref LL_HRTIM_EE_FILTER_8
  *         @arg @ref LL_HRTIM_EE_FILTER_9
  *         @arg @ref LL_HRTIM_EE_FILTER_10
  *         @arg @ref LL_HRTIM_EE_FILTER_11
  *         @arg @ref LL_HRTIM_EE_FILTER_12
  *         @arg @ref LL_HRTIM_EE_FILTER_13
  *         @arg @ref LL_HRTIM_EE_FILTER_14
  *         @arg @ref LL_HRTIM_EE_FILTER_15
  * @retval None
  */
__STATIC_INLINE void LL_HRTIM_EE_SetFilter(HRTIM_TypeDef *HRTIMx, uint32_t Event, uint32_t Filter)
{
  register uint32_t iEvent = (uint8_t)(POSITION_VAL(Event) - POSITION_VAL(LL_HRTIM_EVENT_1));
  MODIFY_REG(HRTIMx->sCommonRegs.EECR3, (HRTIM_EECR3_EE6F << REG_SHIFT_TAB_EExSRC[iEvent]),
             (Filter << REG_SHIFT_TAB_EExSRC[iEvent]));
}

/**
  * @brief  Get actual digital noise filter setting of a external event.
  * @rmtoll EECR3     EE6F         LL_HRTIM_EE_GetFilter\n
  * @rmtoll EECR3     EE7F         LL_HRTIM_EE_GetFilter\n
  * @rmtoll EECR3     EE8F         LL_HRTIM_EE_GetFilter\n
  * @rmtoll EECR3     EE9F         LL_HRTIM_EE_GetFilter\n
  * @rmtoll EECR3     EE10F        LL_HRTIM_EE_GetFilter
  * @param  HRTIMx High Resolution Timer instance
  * @param  Event This parameter can be one of the following values:
  *         @arg @ref LL_HRTIM_EVENT_6
  *         @arg @ref LL_HRTIM_EVENT_7
  *         @arg @ref LL_HRTIM_EVENT_8
  *         @arg @ref LL_HRTIM_EVENT_9
  *         @arg @ref LL_HRTIM_EVENT_10
  * @retval Filter This parameter can be one of the following values:
  *         @arg @ref LL_HRTIM_EE_FILTER_NONE
  *         @arg @ref LL_HRTIM_EE_FILTER_1
  *         @arg @ref LL_HRTIM_EE_FILTER_2
  *         @arg @ref LL_HRTIM_EE_FILTER_3
  *         @arg @ref LL_HRTIM_EE_FILTER_4
  *         @arg @ref LL_HRTIM_EE_FILTER_5
  *         @arg @ref LL_HRTIM_EE_FILTER_6
  *         @arg @ref LL_HRTIM_EE_FILTER_7
  *         @arg @ref LL_HRTIM_EE_FILTER_8
  *         @arg @ref LL_HRTIM_EE_FILTER_9
  *         @arg @ref LL_HRTIM_EE_FILTER_10
  *         @arg @ref LL_HRTIM_EE_FILTER_11
  *         @arg @ref LL_HRTIM_EE_FILTER_12
  *         @arg @ref LL_HRTIM_EE_FILTER_13
  *         @arg @ref LL_HRTIM_EE_FILTER_14
  *         @arg @ref LL_HRTIM_EE_FILTER_15
  */
__STATIC_INLINE uint32_t LL_HRTIM_EE_GetFilter(HRTIM_TypeDef *HRTIMx, uint32_t Event)
{
  register uint32_t iEvent = (uint8_t)(POSITION_VAL(Event) - POSITION_VAL(LL_HRTIM_EVENT_6));
  return (READ_BIT(HRTIMx->sCommonRegs.EECR3,
                   (HRTIM_EECR3_EE6F << REG_SHIFT_TAB_EExSRC[iEvent])) >>  REG_SHIFT_TAB_EExSRC[iEvent]);
}

/**
  * @brief  Set the external event prescaler.
  * @rmtoll EECR3     EEVSD        LL_HRTIM_EE_SetPrescaler
  * @param  HRTIMx High Resolution Timer instance
  * @param  Prescaler This parameter can be one of the following values:
  *         @arg @ref LL_HRTIM_EE_PRESCALER_DIV1
  *         @arg @ref LL_HRTIM_EE_PRESCALER_DIV2
  *         @arg @ref LL_HRTIM_EE_PRESCALER_DIV4
  *         @arg @ref LL_HRTIM_EE_PRESCALER_DIV8
  * @retval None
  */

__STATIC_INLINE void LL_HRTIM_EE_SetPrescaler(HRTIM_TypeDef *HRTIMx, uint32_t Prescaler)
{
  MODIFY_REG(HRTIMx->sCommonRegs.EECR3, HRTIM_EECR3_EEVSD, Prescaler);
}

